bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
// MeshCore group channel structure for LoRa mode
#ifdef HAS_LORA_RADIO
struct MeshCoreChannel {
  uint8_t hash[1];      // First byte of SHA256 of channel secret
  uint8_t secret[32];   // Channel shared secret (PSK)
  size_t secretLen;     // 16 or 32 bytes
};
static MeshCoreChannel meshChannel;
static bool meshChannelConfigured = false;

// Global variables for tracking sent messages and echoes
static uint8_t lastSentCiphertext[256];
static size_t lastSentCiphertextLen = 0;
static volatile bool lastMessageConfirmed = false;

// RX callback for LoRa - logs any received packets for diagnostics
void onLoRaReceive(const uint8_t* data, size_t len) {
  Serial.printf("\n[RX] *** PACKET RECEIVED *** %d bytes\n", (int)len);
  Serial.print("[RX] Hex: ");
  for (size_t i = 0; i < len && i < 64; i++) {
    Serial.printf("%02X ", data[i]);
  }
  Serial.println();
  
  if (len >= 3) {
    uint8_t header = data[0];
    uint8_t routeType = (header >> 4) & 0x0F;
    uint8_t payloadType = header & 0x0F;
    uint8_t pathLen = data[1];
    uint8_t channelHash = data[2]; // This is only true if pathLen is 0!
    
    // Correct parsing based on path length
    // Packet structure: [Header 1][PathLen 1][PathData N][Hash 1][MAC 2][Ciphertext M]
    size_t hashOffset = 2 + pathLen;
    size_t macOffset = hashOffset + 1;
    size_t ciphertextOffset = macOffset + 2;
    
    if (len > ciphertextOffset) {
        channelHash = data[hashOffset];
        Serial.printf("[RX] Header: 0x%02X (route=%d, payload=%d)\n", header, routeType, payloadType);
        Serial.printf("[RX] Path len: %d, Channel hash: 0x%02X\n", pathLen, channelHash);
        
        if (channelHash == meshChannel.hash[0]) {
          Serial.println("[RX] *** MATCHES OUR CHANNEL! ***");
          
          // Check if this is an echo of our last sent message
          // Compare ciphertext (payload)
          size_t incomingCiphertextLen = len - ciphertextOffset;
          if (lastSentCiphertextLen > 0 && incomingCiphertextLen == lastSentCiphertextLen) {
              if (memcmp(&data[ciphertextOffset], lastSentCiphertext, lastSentCiphertextLen) == 0) {
                  Serial.println("[RX] *** ECHO DETECTED: Message confirmed by mesh! ***");
                  lastMessageConfirmed = true;
              }
          }
        } else {
          Serial.printf("[RX] Different channel (ours: 0x%02X)\n", meshChannel.hash[0]);
        }
    }
  }
  Serial.println("[RX] ==================\n");
}
#endif

// BLE/WiFi coexistence - ESP32-S3 cannot run WiFi and BLE simultaneously
// This is not needed for LoRa mode since LoRa and WiFi can coexist
bool bleOperationInProgress = false;
bool monitoringPaused = false;

// MeshCore protocol constants for LoRa mode
// These match the MeshCore mesh packet protocol
#ifdef HAS_LORA_RADIO
static constexpr uint8_t PAYLOAD_TYPE_GRP_TXT = 0x05;  // GroupText (0x5 per capture)
static constexpr uint8_t TXT_TYPE_PLAIN = 0;           // Plain text flag
static constexpr size_t LORA_MAX_TEXT_MESSAGE_LEN = 140;
static constexpr size_t MAX_SENDER_NAME_LEN = 20;
static constexpr uint8_t CIPHER_BLOCK_SIZE = 16;      // AES block size
// MeshCore GroupText uses 2-byte MAC per actual capture (0x10F5)
static constexpr uint8_t CIPHER_MAC_SIZE = 2;         // MAC length

// Decode Base64 PSK from config into meshChannel.secret
bool decodeMeshChannelSecret(const char* pskBase64) {
  if (pskBase64 == nullptr || strlen(pskBase64) == 0) {
    Serial.println("ERROR: MeshCore PSK (Base64) is empty");
    return false;
  }

  unsigned char decoded[64];
  size_t decodedLen = 0;
  int rc = mbedtls_base64_decode(decoded, sizeof(decoded), &decodedLen,
                                 reinterpret_cast<const unsigned char*>(pskBase64), strlen(pskBase64));
  if (rc != 0) {
    Serial.printf("ERROR: Failed to decode MeshCore PSK (Base64), rc=%d\n", rc);
    return false;
  }

  if (decodedLen != 16 && decodedLen != 32) {
    Serial.printf("ERROR: MeshCore PSK length invalid (%d bytes). Expected 16 or 32.\n", (int)decodedLen);
    return false;
  }

  memset(meshChannel.secret, 0, sizeof(meshChannel.secret));
  memcpy(meshChannel.secret, decoded, decodedLen);
  meshChannel.secretLen = decodedLen;
  Serial.printf("[LoRa] PSK decoded len=%d (expected 16 or 32)\n", (int)decodedLen);
  Serial.printf("[LoRa] PSK first 4 bytes: %02X %02X %02X %02X\n", meshChannel.secret[0], meshChannel.secret[1], meshChannel.secret[2], meshChannel.secret[3]);
  return true;
}

/**
 * Configure MeshCore channel from PSK
 * Derives the channel hash from the PSK (per MeshCore spec)
 * @return true if channel was configured successfully
 */
bool configureMeshChannel() {
  if (meshChannelConfigured) {
    return true;
  }
  
  if (!decodeMeshChannelSecret(LORA_MESH_CHANNEL_PSK_BASE64)) {
    recordMeshError("MeshCore PSK decode failed");
    return false;
  }

  // Channel hash: first byte of SHA256(secret)
  uint8_t fullHash[32];
  mbedtls_sha256_context ctx;
  mbedtls_sha256_init(&ctx);
  mbedtls_sha256_starts(&ctx, 0);
  mbedtls_sha256_update(&ctx, meshChannel.secret, meshChannel.secretLen);
  mbedtls_sha256_finish(&ctx, fullHash);
  mbedtls_sha256_free(&ctx);
  meshChannel.hash[0] = fullHash[0];

  meshChannelConfigured = true;
  meshLastError = "";
  Serial.printf("MeshCore channel configured (hash: 0x%02X, keylen: %d)\n", meshChannel.hash[0], (int)meshChannel.secretLen);
  Serial.printf("[LoRa] Channel hash byte = %02X\n", meshChannel.hash[0]);
  return true;
}

/**
 * Ensure LoRa transport is initialized
 * Creates and initializes the LoRa transport if needed
 * @return true if transport is ready to use
 */
bool ensureLoRaTransportInitialized() {
  if (meshTransport != nullptr && meshTransport->isInitialized()) {
    // Transport is up; ensure channel is configured before sending
    if (!meshChannelConfigured && !configureMeshChannel()) {
      recordMeshError("ERROR: Channel configuration failed");
      return false;
    }
    return true;
  }

  Serial.println("[LoRa] ensureLoRaTransportInitialized: creating transport");
  
  // Clean up any partial state
  if (meshTransport != nullptr) {
    delete meshTransport;
    meshTransport = nullptr;
  }
  
  // Create and initialize transport
  LoRaTransport::Config config;
  config.pinNss = LORA_NSS;
  config.pinDio1 = LORA_DIO1;
  config.pinRst = LORA_RST;
  config.pinBusy = LORA_BUSY;
  config.pinMosi = LORA_MOSI;
  config.pinMiso = LORA_MISO;
  config.pinSck = LORA_SCK;
  config.frequency = LORA_FREQUENCY;
  config.bandwidth = LORA_BANDWIDTH;
  config.spreadingFactor = LORA_SPREADING_FACTOR;
  config.codingRate = LORA_CODING_RATE;
  config.syncWord = LORA_SYNC_WORD;
  config.txPower = LORA_TX_POWER;
  config.pinVext = LORA_VEXT_PIN;
  config.txLedPin = LORA_TX_LED_PIN;
  config.tcxoVoltage = LORA_TCXO_VOLTAGE;
  config.preambleLength = LORA_PREAMBLE_LENGTH;
  
  meshTransport = new LoRaTransport(config);
  
  if (!meshTransport->init()) {
    recordMeshError("ERROR: LoRa radio initialization failed");
    delete meshTransport;
    meshTransport = nullptr;
    return false;
  }
  
  // Set RX callback to log received packets
  meshTransport->setRxCallback(onLoRaReceive);
  Serial.println("[LoRa] RX callback registered");
  
