bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Configure channel
  if (!configureMeshChannel()) {
    recordMeshError("ERROR: Channel configuration failed");
    return false;
  }
  
  meshLastError = "";
  Serial.println("[LoRa] Transport initialized and channel configured");
  return true;
}

/**
 * MeshCore encryptThenMAC equivalent:
 * - AES-128 ECB with zero padding to block boundary
 * - HMAC-SHA256(secret) over ciphertext, truncated to 2 bytes
 */
size_t encryptThenMAC(const uint8_t* secret, size_t secretLen, uint8_t* output, const uint8_t* plaintext, size_t plaintextLen) {
  size_t paddedLen = ((plaintextLen + CIPHER_BLOCK_SIZE - 1) / CIPHER_BLOCK_SIZE) * CIPHER_BLOCK_SIZE;
  uint8_t paddedPlaintext[256];
  memcpy(paddedPlaintext, plaintext, plaintextLen);
  if (paddedLen > plaintextLen) {
    memset(paddedPlaintext + plaintextLen, 0, paddedLen - plaintextLen);  // zero padding like Utils::encrypt
  }

  // AES-128 ECB encrypt (key = first 16 bytes of secret)
  uint8_t* ciphertext = output + CIPHER_MAC_SIZE;
  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, secret, 128);
  for (size_t offset = 0; offset < paddedLen; offset += CIPHER_BLOCK_SIZE) {
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_ENCRYPT, paddedPlaintext + offset, ciphertext + offset);
  }
  mbedtls_aes_free(&aes);

  // HMAC-SHA256(secret, ciphertext) truncated to 2 bytes
  unsigned char hmacFull[32];
  mbedtls_md_context_t md;
  const mbedtls_md_info_t* info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
  if (info == nullptr) {
    Serial.println("ERROR: SHA256 HMAC info unavailable");
    return 0;
  }
  mbedtls_md_init(&md);
  mbedtls_md_setup(&md, info, 1);
  mbedtls_md_hmac_starts(&md, secret, secretLen);
  mbedtls_md_hmac_update(&md, ciphertext, paddedLen);
  mbedtls_md_hmac_finish(&md, hmacFull);
  mbedtls_md_free(&md);

  // Copy first 2 bytes of HMAC to output (MAC field)
  memcpy(output, hmacFull, CIPHER_MAC_SIZE);

  return CIPHER_MAC_SIZE + paddedLen;
}

/**
 * Build and send a MeshCore channel message via LoRa
 * Builds a proper PAYLOAD_TYPE_GRP_TXT packet with channel hash, MAC, and encrypted payload
 * @param senderName Name to show as sender (e.g., "ESP32-Uptime")
 * @param message Message text to send
 * @return true if message was sent successfully
 */
bool sendLoRaChannelMessage(const String& senderName, const String& message) {
  Serial.printf("\n=== sendLoRaChannelMessage START ===\n");
  Serial.printf("  Sender: %s\n", senderName.c_str());
  Serial.printf("  Message: %s\n", message.c_str());
  
  if (!ensureLoRaTransportInitialized()) {
    recordMeshError("ERROR: LoRa transport not initialized");
    Serial.println("[LoRa] ensureLoRaTransportInitialized failed");
    return false;
  }
  
  if (!meshChannelConfigured) {
    recordMeshError("ERROR: MeshCore channel not configured");
    Serial.println("[LoRa] channel not configured");
    return false;
  }

  const int MAX_RETRIES = 3;
  bool success = false;

  for (int attempt = 1; attempt <= MAX_RETRIES; attempt++) {
      if (attempt > 1) {
          Serial.printf("\n  --- Retry Attempt %d/%d ---\n", attempt, MAX_RETRIES);
          // Random delay before retry to avoid synchronized collisions and give mesh time to settle
          delay(random(1000, 3000));
      }

      // Build plaintext payload: [timestamp (4)][txt_type (1)][sender: message]
      uint8_t plaintext[256];
      size_t ptIdx = 0;
      
      // Timestamp (little-endian, 4 bytes)
      // We regenerate timestamp on each retry so it's a "new" message
      // This ensures the mesh doesn't drop it as a duplicate if the previous one was heard but echo was missed
      time_t now = time(nullptr);
      uint32_t timestamp = static_cast<uint32_t>(now);
      plaintext[ptIdx++] = timestamp & 0xFF;
      plaintext[ptIdx++] = (timestamp >> 8) & 0xFF;
      plaintext[ptIdx++] = (timestamp >> 16) & 0xFF;
      plaintext[ptIdx++] = (timestamp >> 24) & 0xFF;
      
      // Text type (0 = plain)
      plaintext[ptIdx++] = TXT_TYPE_PLAIN;
      
      // Format message as "sender: message"
      String fullMessage = senderName + ": " + message;
      size_t textLen = fullMessage.length();
      if (textLen > LORA_MAX_TEXT_MESSAGE_LEN) {
        textLen = LORA_MAX_TEXT_MESSAGE_LEN;
      }
      memcpy(&plaintext[ptIdx], fullMessage.c_str(), textLen);
      ptIdx += textLen;
      
      // Build MeshCore GroupText packet
      uint8_t packet[256];
      size_t pktIdx = 0;
      
      // Header: GroupText (0x15)
      packet[pktIdx++] = (0x01 << 4) | PAYLOAD_TYPE_GRP_TXT;
      packet[pktIdx++] = 0x00; // Path len
      packet[pktIdx++] = meshChannel.hash[0]; // Channel hash
      
      // Encrypt
      size_t encryptedLen = encryptThenMAC(meshChannel.secret, meshChannel.secretLen, &packet[pktIdx], plaintext, ptIdx);
      if (encryptedLen == 0) {
        recordMeshError("ERROR: Failed to encrypt MeshCore payload");
        return false;
      }
      
      // Save ciphertext for echo detection
      if (encryptedLen > 2) {
          lastSentCiphertextLen = encryptedLen - 2;
          if (lastSentCiphertextLen > sizeof(lastSentCiphertext)) {
              lastSentCiphertextLen = sizeof(lastSentCiphertext);
          }
          memcpy(lastSentCiphertext, &packet[pktIdx + 2], lastSentCiphertextLen);
          lastMessageConfirmed = false;
      }
      
      pktIdx += encryptedLen;
      
      Serial.printf("  Sending packet (Attempt %d): %d bytes, TS: 0x%08X\n", attempt, (int)pktIdx, timestamp);
      
      // Send raw packet via LoRa
      bool sent = meshTransport->send(packet, pktIdx);
      
      if (sent) {
          Serial.println("  Waiting for mesh confirmation (echo)...");
          unsigned long waitStart = millis();
          bool confirmed = false;
          
          // Wait up to 15 seconds for an echo (mesh can be slow with multiple hops)
          while (millis() - waitStart < 15000) {
              meshTransport->processReceive();
              
              if (lastMessageConfirmed) {
                  confirmed = true;
                  break;
              }
              delay(10);
          }
          
