bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
          if (confirmed) {
              Serial.println("  SUCCESS: Message confirmed by mesh echo!");
              success = true;
              break; // Exit retry loop
          } else {
              Serial.println("  WARNING: No echo received within 15s.");
          }
      } else {
          Serial.println("  ERROR: Radio send failed.");
          recordMeshError("ERROR: LoRa radio send failed");
          
          // If radio send fails, try to re-initialize the transport
          Serial.println("  Attempting to re-initialize LoRa transport...");
          if (meshTransport) {
              delete meshTransport;
              meshTransport = nullptr;
          }
          ensureLoRaTransportInitialized();
      }
  }

  Serial.printf("=== sendLoRaChannelMessage END (success=%d) ===\n\n", success);
  return success;
}
#endif

// Minimum valid Unix timestamp for NTP validation (2021-01-01 00:00:00 UTC)
// Used to detect if time has been properly synchronized via NTP
const time_t MIN_VALID_TIMESTAMP = 1609459200;

// Boot timestamp - captured after initial NTP sync
String bootTimestamp = "Not synchronized";

// Pending MeshCore notification - used to defer BLE operations from HTTP handlers and boot
// This prevents task watchdog timeouts by:
// 1. Allowing the async web server to complete HTTP response delivery before WiFi disconnects
// 2. Deferring boot notifications until after setup() completes to avoid watchdog timeouts
volatile bool pendingMeshNotification = false;
String pendingMeshTitle = "";
String pendingMeshMessage = "";

// Helper functions to access protocol state (for API compatibility)
bool isMeshDeviceConnected() {
  return meshTransport != nullptr && meshTransport->isConnected();
}

bool isMeshChannelReady() {
#ifdef HAS_LORA_RADIO
  // For LoRa mode, channel is ready when transport is initialized and channel is configured
  return meshTransport != nullptr && meshTransport->isInitialized() && meshChannelConfigured;
#else
  return meshProtocol != nullptr && meshProtocol->isChannelReady();
#endif
}

String getMeshLastError() {
#ifdef HAS_LORA_RADIO
  return meshLastError;
#else
  if (meshProtocol != nullptr) {
    return meshProtocol->getLastError();
  }
  if (meshTransport != nullptr) {
    return meshTransport->getLastError();
  }
  return "";
#endif
}

int getMeshProtocolState() {
#ifdef HAS_LORA_RADIO
  // For LoRa mode, return 3 (SessionReady equivalent) if initialized
  return (meshTransport != nullptr && meshTransport->isInitialized()) ? 3 : 0;
#else
  if (meshProtocol != nullptr) {
    return static_cast<int>(meshProtocol->getState());
  }
  return 0;
#endif
}

// Mutex for protecting services array access
SemaphoreHandle_t servicesMutex = NULL;

// Service types
// Right now the behavior for each is rudimentary
// However, you can use this to expand and add services with more complex checks
enum ServiceType {
  TYPE_HTTP_GET,
  TYPE_PING,
  TYPE_SNMP_GET,
  TYPE_PORT,
  TYPE_PUSH,
  TYPE_UPTIME
};

// SNMP comparison operators for value checks
enum SnmpCompareOp {
  SNMP_OP_EQ,    // Equal (=)
  SNMP_OP_NE,    // Not equal (<>)
  SNMP_OP_LT,    // Less than (<)
  SNMP_OP_LE,    // Less than or equal (<=)
  SNMP_OP_GT,    // Greater than (>)
  SNMP_OP_GE     // Greater than or equal (>=)
};

// Service structure
struct Service {
  String id;
  String name;
  ServiceType type;
  String host;
  int port;
  String path;
  String url;             // Full URL for HTTP GET (http:// or https://)
  String expectedResponse;
  int checkInterval;
  int passThreshold;      // Number of consecutive passes required to mark as UP
  int failThreshold;      // Number of consecutive fails required to mark as DOWN
  int rearmCount;         // Number of failed checks before re-alerting (0 = disabled)
  int consecutivePasses;  // Current count of consecutive passes
  int consecutiveFails;   // Current count of consecutive fails
  int failedChecksSinceAlert; // Failed checks since last alert (for re-arm)
  bool isUp;
  bool hasBeenUp;         // Whether service has ever been UP since boot (for initial UP suppression)
  unsigned long lastCheck;
  unsigned long lastUptime;
  String lastError;
  int secondsSinceLastCheck;
  // SNMP-specific fields
  String snmpOid;         // SNMP OID to query (e.g., "1.3.6.1.2.1.1.1.0")
  String snmpCommunity;   // SNMP community string (default: "public")
  SnmpCompareOp snmpCompareOp;  // Comparison operator for SNMP value check
  String snmpExpectedValue;     // Expected value for comparison
  // Uptime-specific fields
  int uptimeThreshold;          // Uptime threshold in seconds
  SnmpCompareOp uptimeCompareOp; // Comparison operator for uptime check
  // Push-specific fields
  String pushToken;       // Unique token for push endpoint (for TYPE_PUSH)
  unsigned long lastPush; // Timestamp of last push received (millis)
  // Enable/disable and pause fields
  bool enabled;           // Whether service checks are enabled
  unsigned long pauseUntil; // Timestamp (millis) until which checks are paused (0 = not paused)
};

// Historical data structure for uptime tracking
// Stores hourly uptime percentage to minimize storage (1 byte per hour)
// With 1MB limit and 20 services, we can store ~52,000 hours (~6 years) per service
struct ServiceHistory {
  String serviceId;
  std::vector<uint8_t> hourlyUptime;  // Each byte is uptime % for that hour (0-100)
  unsigned long firstHourTimestamp;    // Unix timestamp of first hour in history
  int checksThisHour;                  // Number of checks performed this hour
  int passesThisHour;                  // Number of successful checks this hour
  unsigned long currentHourStart;      // Timestamp (seconds) of current hour being tracked
};

// Event log structure for detailed up/down state changes
struct ServiceEvent {
  unsigned long timestamp;  // Unix timestamp (seconds)
  bool isUp;                // true if service went UP, false if it went DOWN
  String reason;            // Optional: reason for the state change
};

