bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
struct ServiceEventLog {
  String serviceId;
  std::vector<ServiceEvent> events;
};

// Store up to 20 services
const int MAX_SERVICES = 20;
Service services[MAX_SERVICES];
int serviceCount = 0;

// Historical data for all services
ServiceHistory serviceHistories[MAX_SERVICES];

// Event logs for all services
ServiceEventLog serviceEventLogs[MAX_SERVICES];

// Historical data constants
const int MAX_HISTORY_HOURS = 720;  // 30 days of hourly data per service (720 bytes/service)
const int DISPLAY_HISTORY_HOURS = 90;  // Show last 90 hours (~4 days) in UI for readability
const int MAX_MISSED_HOURS_TO_FILL = 24;  // Maximum gap to backfill with 0% uptime

// Event log constants
const int MAX_EVENTS_PER_SERVICE = 100;  // Keep last 100 events per service

// Filesystem readiness flag to avoid LittleFS access before mount
static bool littleFsReady = false;

// Port check constants
const int PORT_CHECK_TIMEOUT_MS = 5000;  // TCP connection timeout for port checks

// Push check constants
const unsigned long PUSH_TIMING_MARGIN_MS = 5000;  // Margin for push timing checks

// Regex matching constants
const int MAX_REGEX_PATTERN_LENGTH = 256;
const char* REGEX_PREFIX = "regex:";
const int REGEX_PREFIX_LENGTH = 6;

// Pause/enable constants
// Max pause: ~46 days to safely fit within unsigned long (millis() range)
const int MAX_PAUSE_DURATION_SECONDS = 46 * 24 * 60 * 60;  // 46 days
const unsigned long PAUSE_ROLLOVER_THRESHOLD_MS = 7UL * 24UL * 60UL * 60UL * 1000UL;  // 1 week

// Helper function for rollover-safe pause remaining calculation
// Returns pause remaining in milliseconds, or 0 if pause expired/rolled over
inline unsigned long getPauseRemainingMs(unsigned long pauseUntil, unsigned long currentTime) {
  if (pauseUntil == 0) return 0;
  // If currentTime has passed pauseUntil (normal expiry), remaining will wrap to large value
  // If pauseUntil is in the future, remaining will be the actual time left
  // Both cases are handled by the threshold check below
  unsigned long remaining = pauseUntil - currentTime;
  // If remaining is larger than threshold, assume expired or rollover/reboot
  if (remaining > PAUSE_ROLLOVER_THRESHOLD_MS) return 0;
  return remaining;
}

// Notification queue for failed notifications
// Only stores the latest notification per service (isUp state)
// Tracks which notification channels have failed
struct QueuedNotification {
  String serviceId;      // Service ID this notification is for
  String title;          // Notification title
  String message;        // Notification message
  bool isUp;             // true = online notification, false = offline notification
  String tags;           // ntfy tags (for ntfy notifications)
  bool ntfyPending;      // Needs to be sent via ntfy
  bool discordPending;   // Needs to be sent via Discord
  bool smtpPending;      // Needs to be sent via SMTP
  bool meshPending;      // Needs to be sent via MeshCore
  unsigned long lastRetry; // Last retry attempt timestamp
};

const int MAX_QUEUED_NOTIFICATIONS = MAX_SERVICES;
QueuedNotification notificationQueue[MAX_QUEUED_NOTIFICATIONS];
int queuedNotificationCount = 0;

// Retry interval for failed notifications (30 seconds for WiFi-based)
const unsigned long NOTIFICATION_RETRY_INTERVAL = 30000;

// MeshCore retry interval (10 minutes to prevent frequent WiFi disconnects)
const unsigned long MESHCORE_RETRY_INTERVAL = 600000;
unsigned long lastMeshCoreRetry = 0;

// prototype declarations
void initWiFi();
void initWebServer();
void initFileSystem();
bool ensureAuthenticated(AsyncWebServerRequest* request);
void loadServices();
void saveServices();
String generateServiceId();
String generatePushToken();
void checkServices();
void sendOfflineNotification(const Service& service);
void sendOnlineNotification(const Service& service);
void sendSmtpNotification(const String& title, const String& message);
bool checkHttpGet(Service& service);
bool checkPing(Service& service);
bool checkSnmpGet(Service& service);
bool checkPort(Service& service);
bool checkPush(Service& service);
bool checkUptime(Service& service);
int matchesRegex(const String& text, const String& pattern);
String getWebPage();
String getKioskPage();
String getAdminPage();
String getServiceTypeString(ServiceType type);
String getSnmpCompareOpString(SnmpCompareOp op);
SnmpCompareOp parseSnmpCompareOp(const String& opStr);
bool compareSnmpValue(const String& actualValue, SnmpCompareOp op, const String& expectedValue);
String base64Encode(const String& input);
bool readSmtpResponse(WiFiClient& client, int expectedCode);
bool sendSmtpCommand(WiFiClient& client, const String& command, int expectedCode);
void sendBootNotification();

// Historical data functions
void initServiceHistory(const String& serviceId);
void recordCheckResult(const String& serviceId, bool isUp);
void saveHistory();
void loadHistory();
int getHistoryIndex(const String& serviceId);
void finalizeCurrentHour(int historyIndex);
void removeServiceHistory(const String& serviceId);

// Event log functions
void recordServiceEvent(const String& serviceId, bool isUp, const String& reason = "");
int getEventLogIndex(const String& serviceId);
void initServiceEventLog(const String& serviceId);
void removeServiceEventLog(const String& serviceId);
void saveEventLogs();
void loadEventLogs();

// Notification sending functions that return success status
bool sendNtfyNotificationWithStatus(const String& title, const String& message, const String& tags);
bool sendDiscordNotificationWithStatus(const String& title, const String& message);
bool sendSmtpNotificationWithStatus(const String& title, const String& message);
bool sendMeshCoreNotificationWithStatus(const String& title, const String& message);

// Notification queue functions
void queueNotification(const String& serviceId, const String& title, const String& message, 
                       bool isUp, const String& tags, bool ntfyFailed, bool discordFailed, 
                       bool smtpFailed, bool meshFailed);
void processNotificationQueue();
void processMeshCoreQueue();
int findQueuedNotification(const String& serviceId);
void removeQueuedNotification(int index);

void setup() {
  Serial.begin(115200);
  
