bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Initialize services mutex
  servicesMutex = xSemaphoreCreateMutex();

  // Simple delay for serial initialization - matches working ESP32-4848S040 implementation
  // from ESP32-Uptime-Monitoring-Touch. The previous complex !Serial wait loop was causing
  // issues with serial output on this board.
  delay(1000);

  Serial.println("\n\n========================================");
  Serial.println("   ESP32 Uptime Monitor Starting...");
  Serial.println("========================================");

  // Initialize LED to booting state (blue pulsing)
  setLedStatus(LED_STATUS_BOOTING);

  // Initialize filesystem
  initFileSystem();
  Serial.printf("LittleFS ready: %s\n", littleFsReady ? "yes" : "no");

  // Initialize WiFi
  initWiFi();

  // Load saved services
  loadServices();

  // Load historical data
  loadHistory();

  // Load event logs
  loadEventLogs();

  // Initialize web server
  initWebServer();

#ifdef HAS_LORA_RADIO
  // Initialize LoRa MeshCore radio at boot so logs appear and send path is ready
  initMeshCore();
  Serial.println("[LoRa] initMeshCore() completed (setup)");
#if DEBUG_LORA_BOOT_SEND
  Serial.println("[LoRa] DEBUG_LORA_BOOT_SEND enabled: sending boot test message");
  sendLoRaChannelMessage("ESP32", "Boot test message");
#endif
#endif

  // Send boot notification if enabled and WiFi is connected
  if (BOOT_NOTIFICATION_ENABLED) {
    if (WiFi.status() == WL_CONNECTED) {
      sendBootNotification();
    } else {
      Serial.println("Boot notification skipped: WiFi not connected");
    }
  }

#ifdef HAS_LCD
  // Initialize display and touch controller (if connected)
  initDisplay();
#endif

  Serial.println("System ready!");
  Serial.print("Access web interface at: http://");
  Serial.println(WiFi.localIP());
}

void loop() {
  static unsigned long lastCheckTime = 0;
  static bool hasPerformedChecks = false;  // Track if any check has been performed
  unsigned long currentTime = millis();

#if DEBUG_LORA_FORCE_SEND_INTERVAL_MS > 0
  static unsigned long lastLoRaDebugSend = 0;
  static unsigned long nextDebugSendTime = DEBUG_LORA_FORCE_SEND_INTERVAL_MS;
  static uint32_t debugMsgCounter = 0;
  
  // Add ±5 second jitter to avoid predictable collision patterns
  if (currentTime >= nextDebugSendTime) {
    lastLoRaDebugSend = currentTime;
    debugMsgCounter++;
    
    // Calculate next send time with random jitter: base interval ± 5000ms
    int32_t jitter = (esp_random() % 10001) - 5000;  // -5000 to +5000 ms
    nextDebugSendTime = currentTime + DEBUG_LORA_FORCE_SEND_INTERVAL_MS + jitter;
    Serial.printf("[LoRa] Next debug send in %lu ms (jitter: %ld ms)\n", 
                  nextDebugSendTime - currentTime, jitter);
    
    // Create unique message with timestamp and counter
    time_t now = time(nullptr);
    struct tm* timeinfo = localtime(&now);
    char timeStr[32];
    strftime(timeStr, sizeof(timeStr), "%H:%M:%S", timeinfo);
    
    String debugMsg = String("Test #") + String(debugMsgCounter) + 
                      String(" @") + String(timeStr);
    sendLoRaChannelMessage("ESP32", debugMsg);
  }
#endif

#ifdef HAS_LCD
  // Re-scan I2C periodically if touch is not ready (helps debug startup issues)
  static unsigned long lastI2CScan = 0;
  if (!touchReady && (currentTime - lastI2CScan > 5000)) {
    lastI2CScan = currentTime;
    Serial.println("Touch not ready, re-scanning I2C...");
    Wire.begin(TOUCH_SDA_PIN, TOUCH_SCL_PIN);
    int devicesFound = 0;
    for (byte address = 1; address < 127; address++) {
      Wire.beginTransmission(address);
      if (Wire.endTransmission() == 0) {
        Serial.printf("I2C device found at address 0x%02X\n", address);
        devicesFound++;
      }
    }
    if (devicesFound == 0) Serial.println("No I2C devices found");
    Wire.end();
  }
#endif

  // Update LED animation (call frequently for smooth pulsing)
  updateLed();

#ifdef HAS_LORA_RADIO
  // Poll LoRa receiver so incoming MeshCore packets are processed/logged
  if (meshTransport != nullptr) {
    meshTransport->processReceive();
  }
#endif

  // Process pending MeshCore notifications from HTTP handlers
  // This runs in the main loop to avoid blocking the async web server
  // and prevents task watchdog timeouts from WiFi/BLE switching during HTTP responses
  if (pendingMeshNotification && !bleOperationInProgress) {
    // Copy values and clear flag atomically to prevent race conditions with HTTP handler.
    // The HTTP handler checks both pendingMeshNotification and bleOperationInProgress
    // before writing, so setting the flag false first prevents new writes.
    // We use noInterrupts()/interrupts() to ensure the copy is atomic since
    // the async web server runs in a separate FreeRTOS task.
    noInterrupts();
    pendingMeshNotification = false;
    String title = pendingMeshTitle;
    String message = pendingMeshMessage;
    pendingMeshTitle = "";
    pendingMeshMessage = "";
    interrupts();
    
    sendMeshCoreNotification(title, message);
  }

  // Skip service checks if monitoring is paused (e.g., during BLE operations)
  if (monitoringPaused) {
    delay(10);
    return;
  }

  // Update LED status based on WiFi and service state
  // Priority: No WiFi > MeshCore > Service status
  if (WiFi.status() != WL_CONNECTED) {
    setLedStatus(LED_STATUS_NO_WIFI);
  } else if (!hasPerformedChecks && serviceCount > 0) {
    // Still booting - haven't done any checks yet
    setLedStatus(LED_STATUS_BOOTING);
  } else if (serviceCount == 0) {
    // No services configured - show green (nothing to monitor)
    setLedStatus(LED_STATUS_ALL_UP);
  } else {
    // Check if any enabled service is down (either active or paused)
    bool anyActiveDown = false;
    bool anyPausedDown = false;
    unsigned long currentTimeMs = millis();
    for (int i = 0; i < serviceCount; i++) {
      if (services[i].enabled && !services[i].isUp && services[i].lastCheck > 0) {
        // Check if service is paused (rollover-safe)
        if (getPauseRemainingMs(services[i].pauseUntil, currentTimeMs) > 0) {
          anyPausedDown = true;
        } else {
          anyActiveDown = true;
          break;  // Active down takes priority, no need to check further
        }
      }
    }
    // Priority: Active down (red) > Paused down (orange) > All up (green)
    if (anyActiveDown) {
      setLedStatus(LED_STATUS_ANY_DOWN);
    } else if (anyPausedDown) {
      setLedStatus(LED_STATUS_PAUSED_DOWN);
    } else {
      setLedStatus(LED_STATUS_ALL_UP);
    }
  }

