bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Check services every 5 seconds
  if (currentTime - lastCheckTime >= 5000) {
    checkServices();
    lastCheckTime = currentTime;
    if (serviceCount > 0) {
      hasPerformedChecks = true;
    }
  }

  // Save history periodically (every 5 minutes)
  static unsigned long lastHistorySave = 0;
  if (currentTime - lastHistorySave >= 300000) {  // 5 minutes
    saveHistory();
    lastHistorySave = currentTime;
  }

  // Process notification queue for failed notifications (WiFi-based)
  processNotificationQueue();
  
  // Process MeshCore queue separately (batched, 10 minute interval)
  processMeshCoreQueue();
  
  // Handle OTA update events
  ElegantOTA.loop();

#ifdef HAS_LCD
  // Handle LCD display updates and touch input
  handleDisplayLoop();
#endif

  delay(10);
}

void initWiFi() {
  Serial.println("Connecting to WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
    // Update LED during WiFi connection attempts
    updateLed();
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
    
    // Synchronize time via NTP - required for MeshCore message timestamps
    // Uses UTC (gmtOffset=0, daylightOffset=0) for consistent Unix timestamps
    Serial.println("Synchronizing time via NTP...");
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
    
    // Wait for time to be set (with timeout)
    // Blocking is acceptable here since web server hasn't started yet
    time_t now = 0;
    int ntpAttempts = 0;
    while (now < MIN_VALID_TIMESTAMP && ntpAttempts < 10) {
      delay(500);
      time(&now);
      ntpAttempts++;
    }
    
    if (now >= MIN_VALID_TIMESTAMP) {
      Serial.printf("Time synchronized: %lu\n", (unsigned long)now);
      // Capture boot timestamp for display
      struct tm timeinfo;
      if (getLocalTime(&timeinfo)) {
        char buffer[30];
        strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M:%S UTC", &timeinfo);
        bootTimestamp = String(buffer);
      }
    } else {
      Serial.println("Warning: NTP time sync failed, timestamps may be incorrect");
    }
  } else {
    Serial.println("\nFailed to connect to WiFi!");
    // Set LED to orange to indicate no WiFi
    setLedStatus(LED_STATUS_NO_WIFI);
  }
}

void initMeshCore() {
  Serial.println("Initializing MeshCore protocol stack...");
  Serial.printf("Free heap before init: %d bytes\n", ESP.getFreeHeap());
  
#ifdef HAS_LORA_RADIO
  // LoRa mode: Use built-in SX1262 radio
  LoRaTransport::Config config;
  config.pinNss = LORA_NSS;
  config.pinDio1 = LORA_DIO1;
  config.pinRst = LORA_RST;
  config.pinBusy = LORA_BUSY;
  config.pinMosi = LORA_MOSI;
  config.pinMiso = LORA_MISO;
  config.pinSck = LORA_SCK;
  config.frequency = LORA_FREQUENCY;
  config.bandwidth = LORA_BANDWIDTH;
  config.spreadingFactor = LORA_SPREADING_FACTOR;
  config.codingRate = LORA_CODING_RATE;
  config.syncWord = LORA_SYNC_WORD;
  config.txPower = LORA_TX_POWER;
  config.txLedPin = LORA_TX_LED_PIN;
  config.pinVext = LORA_VEXT_PIN;
  config.preambleLength = LORA_PREAMBLE_LENGTH;
  config.tcxoVoltage = LORA_TCXO_VOLTAGE;
  Serial.printf("[LoRa] Pins NSS=%d DIO1=%d RST=%d BUSY=%d MOSI=%d MISO=%d SCK=%d\n",
                config.pinNss, config.pinDio1, config.pinRst, config.pinBusy,
                config.pinMosi, config.pinMiso, config.pinSck);
  Serial.printf("[LoRa] Params freq=%.3f BW=%.1f SF=%d CR=4/%d SW=0x%04X TX=%d dBm\n",
                config.frequency, config.bandwidth, config.spreadingFactor,
                config.codingRate, config.syncWord, config.txPower);
  
  meshTransport = new LoRaTransport(config);
  Serial.println("[LoRa] LoRaTransport object created");
  meshCodec = new FrameCodec(*meshTransport);
  
  // Initialize the LoRa radio
  if (!meshTransport->init()) {
    Serial.println("ERROR: LoRa radio initialization failed");
    disconnectMeshCore();
    return;
  }
  
  Serial.println("MeshCore LoRa radio ready");
  Serial.printf("[LoRa] meshTransport initialized=%d channelConfigured=%d\n", meshTransport->isInitialized(), meshChannelConfigured);
#else
  // BLE mode: Connect to external MeshCore device
  // Create the layered protocol stack
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  meshTransport = new BLECentralTransport(config);
  meshCodec = new FrameCodec(*meshTransport);
  meshProtocol = new CompanionProtocol(*meshTransport, *meshCodec);
  
  // Initialize and connect
  if (!meshTransport->init()) {
    Serial.println("ERROR: BLE initialization failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  if (!meshTransport->connect()) {
    Serial.println("MeshCore connection failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  // Start session
  if (!meshProtocol->startSession("ESP32-Uptime")) {
    Serial.println("MeshCore session start failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  // Find the configured channel
  uint8_t channelIdx;
  if (!meshProtocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
    Serial.println("Channel not found");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  Serial.printf("MeshCore ready on channel %d\n", channelIdx);
#endif
}

bool ensureAuthenticated(AsyncWebServerRequest* request) {
  if (strlen(WEB_AUTH_USERNAME) == 0 || strlen(WEB_AUTH_PASSWORD) == 0) {
    return true;
  }

  if (request->authenticate(WEB_AUTH_USERNAME, WEB_AUTH_PASSWORD)) {
    return true;
  }

  request->requestAuthentication();
  return false;
}

void initFileSystem() {
  littleFsReady = false;

  // First attempt: try to mount without formatting
  // Explicitly specify partition label "littlefs" (default searches for "spiffs")
  if (LittleFS.begin(false, "/littlefs", 10, "littlefs")) {
    Serial.println("LittleFS mounted successfully");
    littleFsReady = true;
    return;
  }

  Serial.println("LittleFS mount failed, attempting format...");

