bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    String title = "ESP32 Monitor Test";
    String message = "This is a test notification from your ESP32 Uptime Monitor. All notification channels are working correctly.";
    String tags = "test,monitor";
    
    JsonDocument doc;
    JsonArray results = doc["results"].to<JsonArray>();
    int successCount = 0;
    int totalCount = 0;
    
    // Test ntfy
    if (isNtfyConfigured()) {
      totalCount++;
      bool success = sendNtfyNotificationWithStatus(title, message, tags);
      JsonObject ntfyResult = results.add<JsonObject>();
      ntfyResult["channel"] = "ntfy";
      ntfyResult["success"] = success;
      if (success) successCount++;
    }
    
    // Test Discord
    if (isDiscordConfigured()) {
      totalCount++;
      bool success = sendDiscordNotificationWithStatus(title, message);
      JsonObject discordResult = results.add<JsonObject>();
      discordResult["channel"] = "Discord";
      discordResult["success"] = success;
      if (success) successCount++;
    }
    
    // Test SMTP
    if (isSmtpConfigured()) {
      totalCount++;
      bool success = sendSmtpNotificationWithStatus(title, message);
      JsonObject smtpResult = results.add<JsonObject>();
      smtpResult["channel"] = "SMTP";
      smtpResult["success"] = success;
      if (success) successCount++;
    }
    
    // Test MeshCore
    if (isMeshCoreConfigured()) {
      totalCount++;
      
      // Queue the notification instead of sending directly to avoid blocking async_tcp task
      // which causes a watchdog timeout crash
      bool queued = false;
      if (!bleOperationInProgress && !pendingMeshNotification) {
        noInterrupts();
        pendingMeshTitle = title;
        pendingMeshMessage = message;
        pendingMeshNotification = true;
        interrupts();
        queued = true;
      }
      
      JsonObject meshResult = results.add<JsonObject>();
      meshResult["channel"] = "MeshCore";
      if (queued) {
        meshResult["success"] = true;
        meshResult["status"] = "queued";
        successCount++;
      } else {
        meshResult["success"] = false;
        meshResult["error"] = "BLE operation already in progress";
      }
    }
    
    doc["success"] = (successCount > 0);
    doc["allSuccess"] = (successCount == totalCount);
    doc["successCount"] = successCount;
    doc["totalCount"] = totalCount;
    
    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // get services
  server.on("/api/services", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray array = doc["services"].to<JsonArray>();

    unsigned long currentTime = millis();

    for (int i = 0; i < serviceCount; i++) {
      if (services[i].lastCheck > 0) {
        services[i].secondsSinceLastCheck = (currentTime - services[i].lastCheck) / 1000;
      } else {
        services[i].secondsSinceLastCheck = -1; // Never checked
      }

      JsonObject obj = array.add<JsonObject>();
      obj["id"] = services[i].id;
      obj["name"] = services[i].name;
      obj["type"] = getServiceTypeString(services[i].type);
      obj["host"] = services[i].host;
      obj["port"] = services[i].port;
      obj["path"] = services[i].path;
      obj["url"] = services[i].url;
      obj["expectedResponse"] = services[i].expectedResponse;
      obj["checkInterval"] = services[i].checkInterval;
      obj["passThreshold"] = services[i].passThreshold;
      obj["failThreshold"] = services[i].failThreshold;
      obj["rearmCount"] = services[i].rearmCount;
      obj["consecutivePasses"] = services[i].consecutivePasses;
      obj["consecutiveFails"] = services[i].consecutiveFails;
      obj["failedChecksSinceAlert"] = services[i].failedChecksSinceAlert;
      obj["isUp"] = services[i].isUp;
      obj["secondsSinceLastCheck"] = services[i].secondsSinceLastCheck;
      obj["lastError"] = services[i].lastError;
      // SNMP-specific fields
      obj["snmpOid"] = services[i].snmpOid;
      obj["snmpCommunity"] = services[i].snmpCommunity;
      obj["snmpCompareOp"] = getSnmpCompareOpString(services[i].snmpCompareOp);
      obj["snmpExpectedValue"] = services[i].snmpExpectedValue;
      // Uptime-specific fields
      obj["uptimeThreshold"] = services[i].uptimeThreshold;
      obj["uptimeCompareOp"] = getSnmpCompareOpString(services[i].uptimeCompareOp);
      // Push-specific fields
      obj["pushToken"] = services[i].pushToken;
      // Enable/disable and pause fields
      obj["enabled"] = services[i].enabled;
      obj["pauseUntil"] = services[i].pauseUntil;
      // Calculate pause remaining time in seconds (rollover-safe)
      obj["pauseRemaining"] = getPauseRemainingMs(services[i].pauseUntil, currentTime) / 1000;
    }

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // add service
  server.on("/api/services", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

      JsonDocument doc;
      DeserializationError error = deserializeJson(doc, data, len);

      if (error) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      // Check if this is an edit (ID provided) or a new service
      String providedId = doc["id"] | "";
      bool isEdit = (providedId.length() > 0);
      int editIndex = -1;

      if (isEdit) {
        // Find the existing service to edit
        for (int i = 0; i < serviceCount; i++) {
          if (services[i].id == providedId) {
            editIndex = i;
            break;
          }
        }
        if (editIndex == -1) {
          request->send(404, "application/json", "{\"error\":\"Service not found for editing\"}");
          return;
        }
      } else {
        // Adding a new service - check if we have space
        if (serviceCount >= MAX_SERVICES) {
          request->send(400, "application/json", "{\"error\":\"Maximum services reached\"}");
          return;
        }
      }

      Service newService;
      
