bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    if (!found) {
      request->send(404, "application/json", "{\"error\":\"Service not found\"}");
      return;
    }
    
    // Rebuild a fresh, empty history entry so new checks start accumulating immediately
    int historyIndex = getHistoryIndex(serviceId);
    if (historyIndex == -1) {
      initServiceHistory(serviceId);
      historyIndex = getHistoryIndex(serviceId);
    }

    if (historyIndex != -1) {
      serviceHistories[historyIndex].hourlyUptime.clear();
      serviceHistories[historyIndex].checksThisHour = 0;
      serviceHistories[historyIndex].passesThisHour = 0;

      // Anchor the new history window to the current hour
      time_t now = time(nullptr);
      unsigned long currentHour = (now / 3600) * 3600;
      serviceHistories[historyIndex].currentHourStart = currentHour;
      serviceHistories[historyIndex].firstHourTimestamp = currentHour;

      saveHistory();
    }
    
    JsonDocument response;
    response["success"] = true;
    response["message"] = "History cleared";
    
    String responseStr;
    serializeJson(response, responseStr);
    request->send(200, "application/json", responseStr);
  });

#ifdef HAS_LCD
  // Wake screen API endpoint - simulates a screen touch to wake the display
  server.on("/api/screen/wake", HTTP_POST, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }

    if (!displayReady) {
      request->send(503, "application/json", "{\"error\":\"Display not ready\"}");
      return;
    }

    // Wake the screen as if it was touched
    turnScreenOn();

    request->send(200, "application/json", "{\"success\":true,\"message\":\"Screen woken\"}");
  });
#endif

  // Get historical data for a specific service
  server.on("/api/history/*", HTTP_GET, [](AsyncWebServerRequest *request) {
    String path = request->url();
    String serviceId = path.substring(path.lastIndexOf('/') + 1);
    
    if (serviceId.length() == 0) {
      request->send(400, "application/json", "{\"error\":\"Missing service ID\"}");
      return;
    }
    
    // Find the history for this service
    int historyIndex = getHistoryIndex(serviceId);
    if (historyIndex == -1) {
      request->send(404, "application/json", "{\"error\":\"Service history not found\"}");
      return;
    }
    
    JsonDocument doc;
    doc["serviceId"] = serviceHistories[historyIndex].serviceId;
    doc["firstHourTimestamp"] = (unsigned long)serviceHistories[historyIndex].firstHourTimestamp;
    doc["currentHourStart"] = (unsigned long)serviceHistories[historyIndex].currentHourStart;
    
    // Calculate overall uptime percentage
    int totalHours = serviceHistories[historyIndex].hourlyUptime.size();
    if (totalHours > 0) {
      unsigned long totalUptime = 0;
      for (uint8_t uptime : serviceHistories[historyIndex].hourlyUptime) {
        totalUptime += uptime;
      }
      doc["uptimePercentage"] = (float)totalUptime / (float)totalHours;
    } else {
      doc["uptimePercentage"] = 0;
    }
    
    // Include current hour stats
    doc["checksThisHour"] = serviceHistories[historyIndex].checksThisHour;
    doc["passesThisHour"] = serviceHistories[historyIndex].passesThisHour;
    
    // Add hourly uptime data
    JsonArray uptimeArray = doc["hourlyUptime"].to<JsonArray>();
    for (uint8_t uptime : serviceHistories[historyIndex].hourlyUptime) {
      uptimeArray.add(uptime);
    }
    
    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // Get event log for a specific service
  server.on("/api/events/*", HTTP_GET, [](AsyncWebServerRequest *request) {
    String path = request->url();
    String serviceId = path.substring(path.lastIndexOf('/') + 1);
    
    if (serviceId.length() == 0) {
      request->send(400, "application/json", "{\"error\":\"Missing service ID\"}");
      return;
    }
    
    // Validate serviceId format (should be alphanumeric)
    for (unsigned int i = 0; i < serviceId.length(); i++) {
      char c = serviceId.charAt(i);
      if (!isalnum(c)) {
        request->send(400, "application/json", "{\"error\":\"Invalid service ID format\"}");
        return;
      }
    }
    
    // Verify the service exists in the services array
    bool serviceExists = false;
    for (int i = 0; i < serviceCount; i++) {
      if (services[i].id == serviceId) {
        serviceExists = true;
        break;
      }
    }
    
    if (!serviceExists) {
      request->send(404, "application/json", "{\"error\":\"Service not found\"}");
      return;
    }
    
    // Find the event log for this service
    int eventLogIndex = getEventLogIndex(serviceId);
    if (eventLogIndex == -1) {
      // Return empty event log if not found (service exists but no events yet)
      JsonDocument doc;
      doc["serviceId"] = serviceId;
      JsonArray eventsArray = doc["events"].to<JsonArray>();
      String response;
      serializeJson(doc, response);
      request->send(200, "application/json", response);
      return;
    }
    
    JsonDocument doc;
    doc["serviceId"] = serviceEventLogs[eventLogIndex].serviceId;
    
    // Add events array
    JsonArray eventsArray = doc["events"].to<JsonArray>();
    for (const ServiceEvent& event : serviceEventLogs[eventLogIndex].events) {
      JsonObject eventObj = eventsArray.add<JsonObject>();
      eventObj["timestamp"] = event.timestamp;
      eventObj["isUp"] = event.isUp;
      if (event.reason.length() > 0) {
        eventObj["reason"] = event.reason;
      }
    }
    
    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // GET /api/uptime - Return ESP32 uptime in seconds
  server.on("/api/uptime", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["uptime"] = millis() / 1000;
    
    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // Initialize ElegantOTA for firmware updates via web interface
  // Access the update page at /update
  // Use existing web authentication credentials if configured
  if (strlen(WEB_AUTH_USERNAME) > 0 && strlen(WEB_AUTH_PASSWORD) > 0) {
    ElegantOTA.begin(&server, WEB_AUTH_USERNAME, WEB_AUTH_PASSWORD);
  } else {
    ElegantOTA.begin(&server);
  }
  
  server.begin();
  Serial.println("Web server started");
  Serial.println("OTA update available at: http://<ip>/update");
}

String generateServiceId() {
  return String(millis()) + String(random(1000, 9999));
}

String generatePushToken() {
  // Generate a 16-character hex token for push endpoints
  // Uses ESP32's hardware random number generator for better entropy
  String token = "";
  const char hexChars[] = "0123456789abcdef";
  for (int i = 0; i < 16; i++) {
    token += hexChars[esp_random() % 16];
  }
  return token;
}

void checkServices() {
  // Skip all network-dependent checks if WiFi is not connected
  // This prevents crashes from network operations when WiFi is unavailable
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  unsigned long currentTime = millis();

#ifdef HAS_LCD
  bool anyServiceChecked = false;  // Track if any service was checked this cycle
#endif

