bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Handle empty URL
  if (url.length() == 0) {
    service.lastError = "URL not configured";
    return false;
  }
  
  // Handle HTTPS URLs by using WiFiClientSecure
  bool isSecure = url.startsWith("https://");
  WiFiClient* client = nullptr;
  WiFiClient plainClient;
  WiFiClientSecure secureClient;

  if (isSecure) {
    secureClient.setInsecure();  // Skip certificate validation for HTTPS targets
    client = &secureClient;
  } else {
    client = &plainClient;
  }

  // Ensure the underlying client stays in scope for the full request lifecycle
  if (!http.begin(*client, url)) {
    service.lastError = "Invalid URL";
    return false;
  }

  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      if (service.expectedResponse == "*") {
        isUp = true;
      } else {
        String payload = http.getString();
        // Check if expectedResponse is a regex pattern (prefixed with "regex:")
        if (service.expectedResponse.startsWith(REGEX_PREFIX)) {
          String pattern = service.expectedResponse.substring(REGEX_PREFIX_LENGTH);
          int regexResult = matchesRegex(payload, pattern);
          if (regexResult == 0) {
            isUp = true;
          } else if (regexResult == -1) {
            service.lastError = "Regex pattern too long";
          } else if (regexResult == -2) {
            service.lastError = "Invalid regex pattern";
          } else {
            service.lastError = "Regex mismatch";
          }
        } else {
          // Plain substring match
          isUp = payload.indexOf(service.expectedResponse) >= 0;
          if (!isUp) {
            service.lastError = "Response mismatch";
          }
        }
      }
    } else {
      service.lastError = "HTTP " + String(httpCode);
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkPing(Service& service) {
  bool success = Ping.ping(service.host.c_str(), 3);
  if (!success) {
    service.lastError = "Ping timeout";
  }
  return success;
}

bool checkPort(Service& service) {
  WiFiClient client;
  // Attempt TCP connection with configured timeout
  if (client.connect(service.host.c_str(), service.port, PORT_CHECK_TIMEOUT_MS)) {
    client.stop();
    return true;
  }
  service.lastError = "Port closed or unreachable";
  return false;
}

bool checkPush(Service& service) {
  // For push-based services, check if a push was received within the check interval
  unsigned long currentTime = millis();
  
  // If no push has ever been received, treat as not up yet
  if (service.lastPush == 0) {
    service.lastError = "No push received yet";
    return false;
  }
  
  // Check if a push was received within the last check interval period
  // We add some margin to account for timing variations
  unsigned long pushAge = currentTime - service.lastPush;
  unsigned long intervalMs = (unsigned long)service.checkInterval * 1000UL;
  
  if (pushAge <= intervalMs + PUSH_TIMING_MARGIN_MS) {
    return true;
  }
  
  service.lastError = "No push received within interval";
  return false;
}

bool checkUptime(Service& service) {
  // Get current uptime in seconds
  unsigned long uptimeSeconds = millis() / 1000;
  int threshold = service.uptimeThreshold;
  
  // Perform comparison based on operator
  bool result = false;
  switch (service.uptimeCompareOp) {
    case SNMP_OP_EQ:
      result = (uptimeSeconds == threshold);
      break;
    case SNMP_OP_NE:
      result = (uptimeSeconds != threshold);
      break;
    case SNMP_OP_GT:
      result = (uptimeSeconds > threshold);
      break;
    case SNMP_OP_LT:
      result = (uptimeSeconds < threshold);
      break;
    case SNMP_OP_GE:
      result = (uptimeSeconds >= threshold);
      break;
    case SNMP_OP_LE:
      result = (uptimeSeconds <= threshold);
      break;
    default:
      service.lastError = "Invalid comparison operator";
      return false;
  }
  
  // Always store the uptime value in lastError so UI can display it
  service.lastError = "Uptime " + String(uptimeSeconds) + "s";
  
  return result;
}

// Helper function to compare SNMP values based on operator
bool compareSnmpValue(const String& actualValue, SnmpCompareOp op, const String& expectedValue) {
  // Try numeric comparison first
  bool actualIsNumeric = true;
  bool expectedIsNumeric = true;
  float actualNum = 0;
  float expectedNum = 0;
  
  // Check if actual value is numeric
  if (actualValue.length() > 0) {
    char* endPtr;
    actualNum = strtof(actualValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      actualIsNumeric = false;
    }
  } else {
    actualIsNumeric = false;
  }
  
  // Check if expected value is numeric
  if (expectedValue.length() > 0) {
    char* endPtr;
    expectedNum = strtof(expectedValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      expectedIsNumeric = false;
    }
  } else {
    expectedIsNumeric = false;
  }
  
  // Use numeric comparison if both are numeric
  if (actualIsNumeric && expectedIsNumeric) {
    switch (op) {
      case SNMP_OP_EQ: return actualNum == expectedNum;
      case SNMP_OP_NE: return actualNum != expectedNum;
      case SNMP_OP_LT: return actualNum < expectedNum;
      case SNMP_OP_LE: return actualNum <= expectedNum;
      case SNMP_OP_GT: return actualNum > expectedNum;
      case SNMP_OP_GE: return actualNum >= expectedNum;
    }
  }
  
  // Fall back to string comparison for non-numeric values
  int cmp = actualValue.compareTo(expectedValue);
  switch (op) {
    case SNMP_OP_EQ: return cmp == 0;
    case SNMP_OP_NE: return cmp != 0;
    case SNMP_OP_LT: return cmp < 0;
    case SNMP_OP_LE: return cmp <= 0;
    case SNMP_OP_GT: return cmp > 0;
    case SNMP_OP_GE: return cmp >= 0;
  }
  
  return false;
}

// Global variables for SNMP response handling (static to persist across calls)
static bool s_snmpGotResponse = false;
static String s_snmpResponseValue = "";

// SNMP message callback handler
void onSnmpMessage(const SNMP::Message *message, const IPAddress remote, const uint16_t port) {
  if (message && message->getType() == SNMP::Type::GetResponse) {
    SNMP::VarBindList *varbindlist = message->getVarBindList();
    if (varbindlist && varbindlist->count() > 0) {
      SNMP::VarBind *varbind = (*varbindlist)[0];
      if (varbind) {
        SNMP::Type valueType = varbind->getValue()->getType();
        
        // Extract value based on type
        switch (valueType) {
          case SNMP::Type::Integer: {
            SNMP::IntegerBER *intVal = static_cast<SNMP::IntegerBER*>(varbind->getValue());
            s_snmpResponseValue = String(intVal->getValue());
            s_snmpGotResponse = true;
            break;
          }
          case SNMP::Type::Counter32: {
            SNMP::Counter32BER *counterVal = static_cast<SNMP::Counter32BER*>(varbind->getValue());
            s_snmpResponseValue = String(counterVal->getValue());
            s_snmpGotResponse = true;
            break;
          }
          case SNMP::Type::Gauge32: {
            SNMP::Gauge32BER *gaugeVal = static_cast<SNMP::Gauge32BER*>(varbind->getValue());
            s_snmpResponseValue = String(gaugeVal->getValue());
            s_snmpGotResponse = true;
            break;
          }
          case SNMP::Type::TimeTicks: {
            SNMP::TimeTicksBER *timeVal = static_cast<SNMP::TimeTicksBER*>(varbind->getValue());
            s_snmpResponseValue = String(timeVal->getValue());
            s_snmpGotResponse = true;
            break;
          }
          case SNMP::Type::OctetString: {
            SNMP::OctetStringBER *strVal = static_cast<SNMP::OctetStringBER*>(varbind->getValue());
            s_snmpResponseValue = String((char*)strVal->getValue());
            s_snmpGotResponse = true;
            break;
          }
          default:
            break;
        }
      }
    }
  }
}

bool checkSnmpGet(Service& service) {
  // Using patricklaf/SNMP library with Manager class and callback pattern
  String hostStr = service.host;
  String communityStr = service.snmpCommunity;
  String oidStr = service.snmpOid;

  // Resolve hostname to IP
  IPAddress targetIP;
  if (!WiFi.hostByName(hostStr.c_str(), targetIP)) {
    service.lastError = "DNS resolution failed";
    return false;
  }
  
