bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
void processNotificationQueue() {
  if (queuedNotificationCount == 0) return;
  
  unsigned long currentTime = millis();
  bool wifiConnected = WiFi.status() == WL_CONNECTED;
  
  // Process each queued notification (WiFi-based channels only)
  for (int i = 0; i < queuedNotificationCount; i++) {
    QueuedNotification& notification = notificationQueue[i];
    
    // Check if enough time has passed since last retry
    if (currentTime - notification.lastRetry < NOTIFICATION_RETRY_INTERVAL) {
      continue;
    }
    
    notification.lastRetry = currentTime;
    
    // Retry WiFi-based notifications only if WiFi is connected
    if (wifiConnected) {
      if (notification.ntfyPending && isNtfyConfigured()) {
        if (sendNtfyNotificationWithStatus(notification.title, notification.message, notification.tags)) {
          notification.ntfyPending = false;
          Serial.printf("Retry: ntfy notification sent for %s\n", notification.serviceId.c_str());
        }
      }
      
      if (notification.discordPending && isDiscordConfigured()) {
        if (sendDiscordNotificationWithStatus(notification.title, notification.message)) {
          notification.discordPending = false;
          Serial.printf("Retry: Discord notification sent for %s\n", notification.serviceId.c_str());
        }
      }
      
      if (notification.smtpPending && isSmtpConfigured()) {
        if (sendSmtpNotificationWithStatus(notification.title, notification.message)) {
          notification.smtpPending = false;
          Serial.printf("Retry: SMTP notification sent for %s\n", notification.serviceId.c_str());
        }
      }
    }
    
    // Check if all pending notifications for this service have been sent
    // (MeshCore is processed separately in processMeshCoreQueue)
    if (!notification.ntfyPending && !notification.discordPending && 
        !notification.smtpPending && !notification.meshPending) {
      Serial.printf("All notifications sent for %s, removing from queue\n", notification.serviceId.c_str());
      removeQueuedNotification(i);
      i--;  // Adjust index since we removed an element
    }
  }
}

void processMeshCoreQueue() {
  // Check if MeshCore is configured and if we have any pending MeshCore notifications
  if (!isMeshCoreConfigured() || bleOperationInProgress) return;
  
  // Check if any notifications have pending MeshCore messages
  bool hasPendingMesh = false;
  for (int i = 0; i < queuedNotificationCount; i++) {
    if (notificationQueue[i].meshPending) {
      hasPendingMesh = true;
      break;
    }
  }
  if (!hasPendingMesh) return;
  
  // Check if enough time has passed since last MeshCore retry (10 minutes)
  unsigned long currentTime = millis();
  if (currentTime - lastMeshCoreRetry < MESHCORE_RETRY_INTERVAL) {
    return;
  }
  
#ifdef HAS_LORA_RADIO
  // LoRa mode: Send notifications directly via the built-in radio
  // No WiFi/radio coexistence issues - both can run simultaneously
  
  Serial.println("Processing MeshCore queue (LoRa)...");
  
  // Set LED to white to indicate MeshCore communication
  setLedStatus(LED_STATUS_MESHCORE);
  lastMeshCoreRetry = currentTime;
  
  // Ensure transport is initialized
  if (!ensureLoRaTransportInitialized()) {
    Serial.println("ERROR: LoRa radio initialization failed");
    return;
  }
  
  // Send all pending MeshCore notifications using helper function
  for (int i = 0; i < queuedNotificationCount; i++) {
    QueuedNotification& notification = notificationQueue[i];
    if (notification.meshPending) {
      if (sendLoRaChannelMessage("ESP32", notification.title + ": " + notification.message)) {
        Serial.printf("Retry: MeshCore LoRa notification sent for %s\n", notification.serviceId.c_str());
        notification.meshPending = false;
      } else {
        Serial.printf("MeshCore LoRa send failed for %s: %s\n", 
                      notification.serviceId.c_str(), 
                      meshTransport != nullptr ? meshTransport->getLastError().c_str() : "transport not initialized");
      }
      
      // Small delay between messages
      delay(100);
    }
  }
  
  Serial.println("MeshCore LoRa batch operation complete");
  
#else
  // BLE mode: Need to batch operations due to WiFi/BLE coexistence
  Serial.println("Processing MeshCore queue (batched BLE operation)...");
  
  // Set LED to white to indicate MeshCore communication
  setLedStatus(LED_STATUS_MESHCORE);
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  lastMeshCoreRetry = currentTime;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Create the layered protocol stack on heap to reduce stack usage.
  // Stack overflow can occur when these large objects are combined with
  // deep BLE callback chains during sendTextMessageToChannel.
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport* transport = new BLECentralTransport(config);
  FrameCodec* codec = new FrameCodec(*transport);
  CompanionProtocol* protocol = new CompanionProtocol(*transport, *codec);
  
  bool sessionReady = false;
  uint8_t channelIdx = 0;
  bool channelFound = false;
  
  // Initialize, connect and prepare session once
  // Note: sessionReady indicates the MeshCore protocol session is established,
  // independent of whether a channel is found. Messages can be sent to room server
  // even if channel lookup fails.
  if (transport->init()) {
    if (transport->connect()) {
      if (protocol->startSession("ESP32-Uptime")) {
        sessionReady = true;
        Serial.println("MeshCore session ready");
        
        // Find channel if configured
        if (isMeshChannelConfigured()) {
          if (protocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
            channelFound = true;
            Serial.printf("MeshCore batch: channel found at index %d\n", channelIdx);
          } else {
            Serial.printf("MeshCore batch: channel not found - %s\n", protocol->getLastError().c_str());
          }
        }
      } else {
        Serial.printf("MeshCore batch: session start failed - %s\n", protocol->getLastError().c_str());
      }
    } else {
      Serial.printf("MeshCore batch: not connected - %s\n", transport->getLastError().c_str());
    }
  } else {
    Serial.printf("MeshCore batch: BLE init failed - %s\n", transport->getLastError().c_str());
  }
  
  // Send all pending MeshCore notifications in this single session
  if (sessionReady) {
    for (int i = 0; i < queuedNotificationCount; i++) {
      QueuedNotification& notification = notificationQueue[i];
      if (notification.meshPending) {
        String fullMessage = notification.title + ": " + notification.message;
        bool sent = false;
        
        // Send to channel if configured and found
        if (channelFound) {
          if (protocol->sendTextMessageToChannel(channelIdx, fullMessage)) {
            Serial.printf("Retry: MeshCore channel notification sent for %s\n", notification.serviceId.c_str());
            sent = true;
          } else {
            Serial.printf("MeshCore channel send failed for %s: %s\n", 
                          notification.serviceId.c_str(), protocol->getLastError().c_str());
          }
        }
        
        // Send to room server if configured
        if (isMeshRoomServerConfigured()) {
          if (protocol->sendTextMessageToContact(BLE_MESH_ROOM_SERVER_ID, fullMessage, BLE_MESH_ROOM_SERVER_PASSWORD)) {
            Serial.printf("Retry: MeshCore room server notification sent for %s\n", notification.serviceId.c_str());
            sent = true;
          } else {
            Serial.printf("MeshCore room server send failed for %s: %s\n", 
                          notification.serviceId.c_str(), protocol->getLastError().c_str());
          }
        }
        
        if (sent) {
          notification.meshPending = false;
        }
        
        // Small delay between messages to avoid overwhelming the receiver
        delay(100);
      }
    }
  }
  
  // Clear callbacks before cleanup to prevent use-after-free.
  // BLE callbacks could fire during disconnect/deinit and would reference deleted objects.
  codec->clearCallbacks();
  
