bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Disconnect BLE and deinitialize to free resources
  transport->disconnect();
  transport->deinit();
  
  // Clean up heap-allocated objects
  delete protocol;
  delete codec;
  delete transport;
  
  // Reconnect WiFi
  reconnectWiFi();
  
  // Resume monitoring
  bleOperationInProgress = false;
  monitoringPaused = false;
  
  Serial.println("MeshCore batch operation complete");
#endif
  
  // Clean up any notifications that have all channels sent
  for (int i = 0; i < queuedNotificationCount; i++) {
    QueuedNotification& notification = notificationQueue[i];
    if (!notification.ntfyPending && !notification.discordPending && 
        !notification.smtpPending && !notification.meshPending) {
      Serial.printf("All notifications sent for %s, removing from queue\n", notification.serviceId.c_str());
      removeQueuedNotification(i);
      i--;
    }
  }
}

void saveServices() {
  if (!littleFsReady) {
    Serial.println("LittleFS not mounted; skipping saveServices");
    return;
  }

  File file = LittleFS.open("/services.json", "w");
  if (!file) {
    Serial.println("Failed to open services.json for writing");
    return;
  }

  JsonDocument doc;
  JsonArray array = doc["services"].to<JsonArray>();

  for (int i = 0; i < serviceCount; i++) {
    JsonObject obj = array.add<JsonObject>();
    obj["id"] = services[i].id;
    obj["name"] = services[i].name;
    obj["type"] = (int)services[i].type;
    obj["host"] = services[i].host;
    obj["port"] = services[i].port;
    obj["path"] = services[i].path;
    obj["url"] = services[i].url;
    obj["expectedResponse"] = services[i].expectedResponse;
    obj["checkInterval"] = services[i].checkInterval;
    obj["passThreshold"] = services[i].passThreshold;
    obj["failThreshold"] = services[i].failThreshold;
    obj["rearmCount"] = services[i].rearmCount;
    // SNMP-specific fields
    obj["snmpOid"] = services[i].snmpOid;
    obj["snmpCommunity"] = services[i].snmpCommunity;
    obj["snmpCompareOp"] = (int)services[i].snmpCompareOp;
    obj["snmpExpectedValue"] = services[i].snmpExpectedValue;
    // Push-specific fields
    obj["pushToken"] = services[i].pushToken;
    // Enable/disable and pause fields
    obj["enabled"] = services[i].enabled;
    obj["pauseUntil"] = services[i].pauseUntil;
  }

  if (serializeJson(doc, file) == 0) {
    Serial.println("Failed to serialize services.json");
  }
  file.close();
  Serial.println("Services saved");
}

void loadServices() {
  if (!littleFsReady) {
    Serial.println("LittleFS not mounted; skipping loadServices");
    return;
  }

  if (!LittleFS.exists("/services.json")) {
    Serial.println("No services.json found, creating empty services list");
    File newFile = LittleFS.open("/services.json", "w");
    if (newFile) {
      JsonDocument emptyDoc;
      emptyDoc.createNestedArray("services");
      serializeJson(emptyDoc, newFile);
      newFile.close();
    } else {
      Serial.println("ERROR: Failed to create services.json");
    }
  }

  File file = LittleFS.open("/services.json", "r");
  if (!file) {
    Serial.println("No services.json found, starting fresh");
    return;
  }

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, file);
  file.close();

  if (error) {
    Serial.println("Failed to parse services.json");
    return;
  }

  JsonArray array = doc["services"];
  serviceCount = 0;

  for (JsonObject obj : array) {
    if (serviceCount >= MAX_SERVICES) break;

    services[serviceCount].id = obj["id"].as<String>();
    services[serviceCount].name = obj["name"].as<String>();
    services[serviceCount].type = (ServiceType)obj["type"].as<int>();
    services[serviceCount].host = obj["host"].as<String>();
    services[serviceCount].port = obj["port"];
    services[serviceCount].path = obj["path"].as<String>();
    services[serviceCount].url = obj["url"] | "";
    // Backward compatibility: generate URL from host/port/path if URL is empty
    if (services[serviceCount].url.length() == 0 && 
        services[serviceCount].type == TYPE_HTTP_GET &&
        services[serviceCount].host.length() > 0) {
      // Use HTTPS if port is 443, otherwise use HTTP
      String protocol = (services[serviceCount].port == 443) ? "https://" : "http://";
      services[serviceCount].url = protocol + services[serviceCount].host + 
                                   ":" + String(services[serviceCount].port) + 
                                   services[serviceCount].path;
    }
    services[serviceCount].expectedResponse = obj["expectedResponse"].as<String>();
    services[serviceCount].checkInterval = obj["checkInterval"];
    services[serviceCount].passThreshold = obj["passThreshold"] | 1;
    services[serviceCount].failThreshold = obj["failThreshold"] | 3;
    services[serviceCount].rearmCount = obj["rearmCount"] | 1440;
    // SNMP-specific fields
    services[serviceCount].snmpOid = obj["snmpOid"] | "";
    services[serviceCount].snmpCommunity = obj["snmpCommunity"] | "public";
    services[serviceCount].snmpCompareOp = (SnmpCompareOp)(obj["snmpCompareOp"].as<int>());
    services[serviceCount].snmpExpectedValue = obj["snmpExpectedValue"] | "";
    // Push-specific fields
    services[serviceCount].pushToken = obj["pushToken"] | "";
    services[serviceCount].lastPush = 0;
    services[serviceCount].consecutivePasses = 0;
    services[serviceCount].consecutiveFails = 0;
    services[serviceCount].failedChecksSinceAlert = 0;
    services[serviceCount].isUp = false;
    services[serviceCount].hasBeenUp = false;
    services[serviceCount].lastCheck = 0;
    services[serviceCount].lastUptime = 0;
    services[serviceCount].lastError = "";
    services[serviceCount].secondsSinceLastCheck = -1;
    // Enable/disable and pause fields
    services[serviceCount].enabled = obj["enabled"] | true;  // Default to enabled
    services[serviceCount].pauseUntil = obj["pauseUntil"] | 0;

    serviceCount++;
  }

  Serial.printf("Loaded %d services\n", serviceCount);
}

// ---- Historical Data Functions ----

