bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
// Get history array index for a given service ID
int getHistoryIndex(const String& serviceId) {
  for (int i = 0; i < MAX_SERVICES; i++) {
    if (serviceHistories[i].serviceId == serviceId) {
      return i;
    }
  }
  return -1;
}

// Initialize history tracking for a new service
void initServiceHistory(const String& serviceId) {
  // Find empty slot
  int index = -1;
  for (int i = 0; i < MAX_SERVICES; i++) {
    if (serviceHistories[i].serviceId.length() == 0) {
      index = i;
      break;
    }
  }
  
  if (index == -1) {
    Serial.println("ERROR: No space for service history");
    return;
  }
  
  serviceHistories[index].serviceId = serviceId;
  serviceHistories[index].hourlyUptime.clear();
  serviceHistories[index].firstHourTimestamp = 0;
  serviceHistories[index].checksThisHour = 0;
  serviceHistories[index].passesThisHour = 0;
  serviceHistories[index].currentHourStart = 0;
  
  Serial.printf("Initialized history for service: %s\n", serviceId.c_str());
}

// Finalize the current hour by calculating uptime percentage and storing it
void finalizeCurrentHour(int historyIndex) {
  if (historyIndex < 0 || historyIndex >= MAX_SERVICES) return;
  if (serviceHistories[historyIndex].checksThisHour == 0) return;
  
  // Calculate uptime percentage for this hour (0-100)
  // Use floating-point math and rounding for accurate percentages
  uint8_t uptimePercent = (uint8_t)((serviceHistories[historyIndex].passesThisHour * 100.0f) / 
                          serviceHistories[historyIndex].checksThisHour + 0.5f);
  
  // Add to history
  serviceHistories[historyIndex].hourlyUptime.push_back(uptimePercent);
  
  // Enforce max history size per service
  if (serviceHistories[historyIndex].hourlyUptime.size() > MAX_HISTORY_HOURS) {
    // Remove oldest hour
    serviceHistories[historyIndex].hourlyUptime.erase(
      serviceHistories[historyIndex].hourlyUptime.begin()
    );
    // Update first hour timestamp
    serviceHistories[historyIndex].firstHourTimestamp += 3600;
  }
  
  // Reset counters for next hour
  serviceHistories[historyIndex].checksThisHour = 0;
  serviceHistories[historyIndex].passesThisHour = 0;
}

// Record a check result for historical tracking
void recordCheckResult(const String& serviceId, bool isUp) {
  int historyIndex = getHistoryIndex(serviceId);
  if (historyIndex == -1) {
    // Initialize if not found
    initServiceHistory(serviceId);
    historyIndex = getHistoryIndex(serviceId);
    if (historyIndex == -1) return;  // Failed to initialize
  }
  
  // Get current time (use Unix timestamp)
  time_t now = time(nullptr);
  
  // If this is the first check, set up the time tracking
  if (serviceHistories[historyIndex].currentHourStart == 0) {
    serviceHistories[historyIndex].currentHourStart = (now / 3600) * 3600;  // Round to hour
    serviceHistories[historyIndex].firstHourTimestamp = serviceHistories[historyIndex].currentHourStart;
  }
  
  // Check if we've moved to a new hour
  unsigned long currentHour = (now / 3600) * 3600;
  if (currentHour > serviceHistories[historyIndex].currentHourStart) {
    // Finalize the previous hour
    finalizeCurrentHour(historyIndex);
    
    // Handle any skipped hours (if checks were paused or system was down)
    // Cap at MAX_MISSED_HOURS_TO_FILL to prevent excessive backfill
    unsigned long missedHours = (currentHour - serviceHistories[historyIndex].currentHourStart) / 3600 - 1;
    for (unsigned long i = 0; i < missedHours && i < MAX_MISSED_HOURS_TO_FILL; i++) {
      // Add 0% uptime for missed hours
      serviceHistories[historyIndex].hourlyUptime.push_back(0);
      if (serviceHistories[historyIndex].hourlyUptime.size() > MAX_HISTORY_HOURS) {
        serviceHistories[historyIndex].hourlyUptime.erase(
          serviceHistories[historyIndex].hourlyUptime.begin()
        );
        serviceHistories[historyIndex].firstHourTimestamp += 3600;
      }
    }
    
    serviceHistories[historyIndex].currentHourStart = currentHour;
  }
  
  // Record this check
  serviceHistories[historyIndex].checksThisHour++;
  if (isUp) {
    serviceHistories[historyIndex].passesThisHour++;
  }
}

// Save history to filesystem
void saveHistory() {
  if (!littleFsReady) {
    Serial.println("LittleFS not mounted; skipping saveHistory");
    return;
  }
  
  File file = LittleFS.open("/history.json", "w");
  if (!file) {
    Serial.println("Failed to open history.json for writing");
    return;
  }
  
  JsonDocument doc;
  JsonArray array = doc["histories"].to<JsonArray>();
  
  size_t totalBytes = 0;
  for (int i = 0; i < MAX_SERVICES; i++) {
    if (serviceHistories[i].serviceId.length() == 0) continue;
    
    JsonObject obj = array.add<JsonObject>();
    obj["serviceId"] = serviceHistories[i].serviceId;
    obj["firstHourTimestamp"] = (unsigned long)serviceHistories[i].firstHourTimestamp;
    obj["currentHourStart"] = (unsigned long)serviceHistories[i].currentHourStart;
    obj["checksThisHour"] = serviceHistories[i].checksThisHour;
    obj["passesThisHour"] = serviceHistories[i].passesThisHour;
    
    // Store hourly uptime as array
    JsonArray uptimeArray = obj["hourlyUptime"].to<JsonArray>();
    for (uint8_t uptime : serviceHistories[i].hourlyUptime) {
      uptimeArray.add(uptime);
    }
    
    totalBytes += serviceHistories[i].hourlyUptime.size();
  }
  
  if (serializeJson(doc, file) == 0) {
    Serial.println("Failed to serialize history.json");
  } else {
    Serial.printf("History saved (%zu bytes tracked)\n", totalBytes);
  }
  file.close();
}

// Load history from filesystem
void loadHistory() {
  if (!littleFsReady) {
    Serial.println("LittleFS not mounted; skipping loadHistory");
    return;
  }
  
  // Initialize all histories to empty
  for (int i = 0; i < MAX_SERVICES; i++) {
    serviceHistories[i].serviceId = "";
    serviceHistories[i].hourlyUptime.clear();
    serviceHistories[i].firstHourTimestamp = 0;
    serviceHistories[i].checksThisHour = 0;
    serviceHistories[i].passesThisHour = 0;
    serviceHistories[i].currentHourStart = 0;
  }
  
  File file = LittleFS.open("/history.json", "r");
  if (!file) {
    Serial.println("No history.json found, starting fresh");
    return;
  }
  
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, file);
  file.close();
  
  if (error) {
    Serial.println("Failed to parse history.json");
    return;
  }
  
  JsonArray array = doc["histories"];
  int historyCount = 0;
  
  for (JsonObject obj : array) {
    if (historyCount >= MAX_SERVICES) break;
    
    serviceHistories[historyCount].serviceId = obj["serviceId"].as<String>();
    serviceHistories[historyCount].firstHourTimestamp = obj["firstHourTimestamp"] | 0;
    serviceHistories[historyCount].currentHourStart = obj["currentHourStart"] | 0;
    serviceHistories[historyCount].checksThisHour = obj["checksThisHour"] | 0;
    serviceHistories[historyCount].passesThisHour = obj["passesThisHour"] | 0;
    
