bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    JsonArray uptimeArray = obj["hourlyUptime"];
    for (JsonVariant v : uptimeArray) {
      serviceHistories[historyCount].hourlyUptime.push_back(v.as<uint8_t>());
    }
    
    historyCount++;
  }
  
  Serial.printf("Loaded history for %d services\n", historyCount);
}

// Remove history for a specific service (when service is deleted)
void removeServiceHistory(const String& serviceId) {
  int historyIndex = getHistoryIndex(serviceId);
  if (historyIndex == -1) {
    return;  // History not found, nothing to remove
  }
  
  // Clear the history data
  serviceHistories[historyIndex].serviceId = "";
  serviceHistories[historyIndex].hourlyUptime.clear();
  serviceHistories[historyIndex].firstHourTimestamp = 0;
  serviceHistories[historyIndex].checksThisHour = 0;
  serviceHistories[historyIndex].passesThisHour = 0;
  serviceHistories[historyIndex].currentHourStart = 0;
  
  Serial.printf("Removed history for service: %s\n", serviceId.c_str());
  
  // Save the updated history to disk
  saveHistory();
}

// ---- Event Log Functions ----

// Get event log array index for a given service ID
int getEventLogIndex(const String& serviceId) {
  for (int i = 0; i < MAX_SERVICES; i++) {
    if (serviceEventLogs[i].serviceId == serviceId) {
      return i;
    }
  }
  return -1;
}

// Initialize event log for a new service
void initServiceEventLog(const String& serviceId) {
  // Find empty slot
  int index = -1;
  for (int i = 0; i < MAX_SERVICES; i++) {
    if (serviceEventLogs[i].serviceId.length() == 0) {
      index = i;
      break;
    }
  }
  
  if (index == -1) {
    Serial.println("ERROR: No space for service event log");
    return;
  }
  
  serviceEventLogs[index].serviceId = serviceId;
  serviceEventLogs[index].events.clear();
  
  Serial.printf("Initialized event log for service: %s\n", serviceId.c_str());
}

// Record a service state change event
void recordServiceEvent(const String& serviceId, bool isUp, const String& reason) {
  int eventLogIndex = getEventLogIndex(serviceId);
  
  // If event log doesn't exist yet, initialize it
  if (eventLogIndex == -1) {
    initServiceEventLog(serviceId);
    eventLogIndex = getEventLogIndex(serviceId);
  }
  
  if (eventLogIndex == -1) {
    Serial.println("ERROR: Failed to initialize event log");
    return;
  }
  
  // Get current Unix timestamp
  time_t now;
  time(&now);
  
  // Create new event
  ServiceEvent event;
  event.timestamp = (unsigned long)now;
  event.isUp = isUp;
  event.reason = reason;
  
  // Add event to the log
  serviceEventLogs[eventLogIndex].events.push_back(event);
  
  // Enforce max events per service
  if (serviceEventLogs[eventLogIndex].events.size() > MAX_EVENTS_PER_SERVICE) {
    // Remove oldest event
    serviceEventLogs[eventLogIndex].events.erase(
      serviceEventLogs[eventLogIndex].events.begin()
    );
  }
  
  Serial.printf("Recorded event for service '%s': %s at %lu\n", 
    serviceId.c_str(), isUp ? "UP" : "DOWN", event.timestamp);
  
  // Save event logs to disk immediately to prevent data loss
  // State changes are infrequent enough that flash wear is not a concern
  // (similar to how saveHistory() is called on every check result)
  saveEventLogs();
}

// Remove event log for a service
void removeServiceEventLog(const String& serviceId) {
  int eventLogIndex = getEventLogIndex(serviceId);
  if (eventLogIndex == -1) {
    return;  // Event log not found, nothing to remove
  }
  
  // Clear the event log data
  serviceEventLogs[eventLogIndex].serviceId = "";
  serviceEventLogs[eventLogIndex].events.clear();
  
  Serial.printf("Removed event log for service: %s\n", serviceId.c_str());
  
  // Save the updated event logs to disk
  saveEventLogs();
}

// Save event logs to LittleFS
void saveEventLogs() {
  if (!littleFsReady) {
    Serial.println("WARN: Skipping event log save - LittleFS not ready");
    return;
  }
  
  File file = LittleFS.open("/event_logs.json", "w");
  if (!file) {
    Serial.println("ERROR: Failed to open event_logs.json for writing");
    return;
  }
  
  JsonDocument doc;
  JsonArray logsArray = doc["eventLogs"].to<JsonArray>();
  
  for (int i = 0; i < MAX_SERVICES; i++) {
    if (serviceEventLogs[i].serviceId.length() == 0) continue;
    
    JsonObject obj = logsArray.add<JsonObject>();
    obj["serviceId"] = serviceEventLogs[i].serviceId;
    
    JsonArray eventsArray = obj["events"].to<JsonArray>();
    for (const ServiceEvent& event : serviceEventLogs[i].events) {
      JsonObject eventObj = eventsArray.add<JsonObject>();
      eventObj["timestamp"] = event.timestamp;
      eventObj["isUp"] = event.isUp;
      if (event.reason.length() > 0) {
        eventObj["reason"] = event.reason;
      }
    }
  }
  
  serializeJson(doc, file);
  file.close();
  
  Serial.println("Event logs saved to LittleFS");
}

// Load event logs from LittleFS
void loadEventLogs() {
  if (!littleFsReady) {
    Serial.println("WARN: Skipping event log load - LittleFS not ready");
    return;
  }
  
  // Clear existing event logs only if they have data
  for (int i = 0; i < MAX_SERVICES; i++) {
    if (serviceEventLogs[i].serviceId.length() > 0 || serviceEventLogs[i].events.size() > 0) {
      serviceEventLogs[i].serviceId = "";
      serviceEventLogs[i].events.clear();
    }
  }
  
  if (!LittleFS.exists("/event_logs.json")) {
    Serial.println("No event_logs.json file found - creating empty log");
    File newFile = LittleFS.open("/event_logs.json", "w");
    if (newFile) {
      JsonDocument emptyDoc;
      emptyDoc.createNestedArray("eventLogs");
      serializeJson(emptyDoc, newFile);
      newFile.close();
    } else {
      Serial.println("ERROR: Failed to create event_logs.json");
    }
    return;
  }
  
  File file = LittleFS.open("/event_logs.json", "r");
  if (!file) {
    Serial.println("ERROR: Failed to open event_logs.json for reading");
    return;
  }
  
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, file);
  file.close();
  
  if (error) {
    Serial.printf("ERROR: Failed to parse event_logs.json: %s\n", error.c_str());
    return;
  }
  
