bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
            const bars = recentHistory.map(uptime => {
                let className = 'history-bar';
                if (uptime >= 95) className += ' up-100';
                else if (uptime >= 75) className += ' up-75';
                else if (uptime >= 50) className += ' up-50';
                else if (uptime > 0) className += ' up-25';
                else className += ' up-0';
                return `<div class="${className}" title="${uptime}% uptime"></div>`;
            }).join('');
            
            return `
                <div class="history-container" data-service-id="${serviceId}" title="Click to view event log">
                    <div class="history-graph">${bars}</div>
                    <span class="uptime-percentage">${uptimePercent}%</span>
                </div>
            `;
        }
        
        async function showEventLog(serviceId) {
            // Find the service name
            const service = services.find(s => s.id === serviceId);
            const serviceName = service ? service.name : 'Service';
            
            // Update modal title
            document.getElementById('modalServiceName').textContent = `Event Log - ${serviceName}`;
            
            // Show modal
            document.getElementById('eventModal').classList.add('show');
            
            // Show loading state
            document.getElementById('eventList').innerHTML = '<div class="no-events">Loading events...</div>';
            
            try {
                // Fetch event log
                const response = await fetch(`/api/events/${serviceId}`);
                const data = await response.json();
                
                // Render events
                const eventList = document.getElementById('eventList');
                
                if (!data.events || data.events.length === 0) {
                    eventList.innerHTML = '<div class="no-events">No events recorded yet</div>';
                    return;
                }
                
                // Sort events by timestamp (most recent first)
                const sortedEvents = [...data.events].sort((a, b) => b.timestamp - a.timestamp);
                
                eventList.innerHTML = sortedEvents.map(event => {
                    const date = new Date(event.timestamp * 1000);
                    const timeStr = date.toLocaleString();
                    const statusClass = event.isUp ? 'up' : 'down';
                    const statusText = event.isUp ? 'Service UP' : 'Service DOWN';
                    
                    return `
                        <div class="event-item ${statusClass}">
                            <div class="event-time">${timeStr}</div>
                            <div class="event-status">${statusText}</div>
                            ${event.reason ? `<div class="event-reason">${event.reason}</div>` : ''}
                        </div>
                    `;
                }).join('');
            } catch (error) {
                console.error('Error loading events:', error);
                document.getElementById('eventList').innerHTML = '<div class="no-events">Error loading events</div>';
            }
        }
        
        function closeEventModal() {
            document.getElementById('eventModal').classList.remove('show');
        }
        
        // Close modal when clicking outside
        window.onclick = function(event) {
            const modal = document.getElementById('eventModal');
            if (event.target === modal) {
                closeEventModal();
            }
        };
        
        // Close modal on Escape key
        document.addEventListener('keydown', function(event) {
            if (event.key === 'Escape') {
                closeEventModal();
            }
        });
        
        function renderServices() {
            const tbody = document.getElementById('servicesTableBody');
            const table = document.getElementById('statusTable');
            const emptyState = document.getElementById('emptyState');
            if (services.length === 0) {
                table.classList.add('hidden');
                emptyState.classList.remove('hidden');
                return;
            }
            table.classList.remove('hidden');
            emptyState.classList.add('hidden');
            tbody.innerHTML = services.map(service => {
                let uptimeStr = 'Not checked yet';
                if (service.secondsSinceLastCheck >= 0) {
                    const seconds = service.secondsSinceLastCheck;
                    if (seconds < 60) {
                        uptimeStr = `${seconds}s ago`;
                    } else if (seconds < 3600) {
                        const minutes = Math.floor(seconds / 60);
                        const secs = seconds % 60;
                        uptimeStr = `${minutes}m ${secs}s ago`;
                    } else {
                        const hours = Math.floor(seconds / 3600);
                        const minutes = Math.floor((seconds % 3600) / 60);
                        uptimeStr = `${hours}h ${minutes}m ago`;
                    }
                }
                const isPending = service.secondsSinceLastCheck < 0;
                let statusText = service.isUp ? 'UP' : 'DOWN';
                let statusClass = service.isUp ? 'up' : 'down';
                
                // For uptime type, show actual uptime value instead of UP/DOWN
                if (service.type === 'uptime') {
                    const uptimeSeconds = Math.floor(Date.now() / 1000) - Math.floor((Date.now() - service.secondsSinceLastCheck * 1000) / 1000) + service.secondsSinceLastCheck;
                    let displayUptime = uptimeSeconds;
                    if (service.lastError && service.lastError.includes('Uptime')) {
                        const match = service.lastError.match(/Uptime (\d+)s/);
                        if (match) displayUptime = parseInt(match[1]);
                    }
                    const days = Math.floor(displayUptime / 86400);
                    const hours = Math.floor((displayUptime % 86400) / 3600);
                    const minutes = Math.floor((displayUptime % 3600) / 60);
                    if (days > 0) {
                        statusText = `${days}d ${hours}h`;
                    } else if (hours > 0) {
                        statusText = `${hours}h ${minutes}m`;
                    } else {
                        statusText = `${minutes}m`;
                    }
                    statusClass = service.isUp ? 'up' : 'down';
                }
                
                if (isPending) {
                    statusText = 'PENDING';
                    statusClass = 'pending';
                } else if (!service.enabled) {
                    statusText = 'DISABLED';
                    statusClass = 'paused';
                } else if (service.pauseRemaining > 0) {
                    const pauseMins = Math.floor(service.pauseRemaining / 60);
                    const pauseSecs = service.pauseRemaining % 60;
                    const pauseStr = pauseMins > 0 ? `${pauseMins}m ${pauseSecs}s` : `${pauseSecs}s`;
                    statusText = `PAUSED (${pauseStr})`;
                    statusClass = 'paused';
                }
                // Format service type for display
                const typeDisplay = service.type.replace('_', ' ').toUpperCase();
                return `
                    <tr>
                        <td class="service-name">${service.name}</td>
                        <td>${typeDisplay}</td>
                        <td><span class="status-badge ${statusClass}">${statusText}</span></td>
                        <td>${renderHistoryGraph(service.id)}</td>
                        <td>${uptimeStr}</td>
                    </tr>
                `;
            }).join('');
        }
        
        // Add event delegation for history clicks (XSS-safe)
        document.addEventListener('click', function(event) {
            const historyContainer = event.target.closest('.history-container');
            if (historyContainer) {
                const serviceId = historyContainer.getAttribute('data-service-id');
                if (serviceId) {
                    showEventLog(serviceId);
                }
            }
        });
        
        setInterval(loadServices, 5000);
        loadServices();
    </script>
</body>
</html>)rawliteral";
}

