bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
            tbody.innerHTML = services.map(service => {
                const lastChecked = getLastCheckedText(service.secondsSinceLastCheck);
                const isPending = service.secondsSinceLastCheck < 0;
                let statusText = service.isUp ? 'UP' : 'DOWN';
                let statusClass = service.isUp ? 'up' : 'down';
                
                // For uptime type, show actual uptime value instead of UP/DOWN
                if (service.type === 'uptime') {
                    const uptimeSeconds = Math.floor(Date.now() / 1000) - Math.floor((Date.now() - service.secondsSinceLastCheck * 1000) / 1000) + service.secondsSinceLastCheck;
                    let displayUptime = uptimeSeconds;
                    if (service.lastError && service.lastError.includes('Uptime')) {
                        const match = service.lastError.match(/Uptime (\\d+)s/);
                        if (match) displayUptime = parseInt(match[1]);
                    }
                    const days = Math.floor(displayUptime / 86400);
                    const hours = Math.floor((displayUptime % 86400) / 3600);
                    const minutes = Math.floor((displayUptime % 3600) / 60);
                    if (days > 0) {
                        statusText = `${days}d ${hours}h ${minutes}m`;
                    } else if (hours > 0) {
                        statusText = `${hours}h ${minutes}m`;
                    } else {
                        statusText = `${minutes}m`;
                    }
                    statusClass = service.isUp ? 'up' : 'down';
                }
                
                if (isPending) { statusText = 'PENDING'; statusClass = 'pending'; }
                else if (!service.enabled) { statusText = 'DISABLED'; statusClass = 'paused'; }
                else if (service.pauseRemaining > 0) { statusText = 'PAUSED'; statusClass = 'paused'; }

                return `
                    <tr>
                        <td class="service-name">${service.name}</td>
                        <td>${service.type.replace('_', ' ').toUpperCase()}</td>
                        <td><span class="status-badge ${statusClass}">${statusText}</span></td>
                        <td>${renderHistoryGraph(service.id)}</td>
                        <td>${lastChecked}</td>
                    </tr>
                `;
            }).join('');
        }

        setInterval(loadServices, 15000);
        loadServices();
    </script>
</body>
</html>)rawliteral";
}
String getAdminPage() {
  return R"rawliteral(<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ESP32 Uptime Monitor - Admin</title>
    <style>
        * {
            margin: 0;
            padding: 0;
            box-sizing: border-box;
        }

        body {
            font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, sans-serif;
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            min-height: 100vh;
            padding: 20px;
        }

        .container {
            max-width: 1200px;
            margin: 0 auto;
        }

        .header {
            text-align: center;
            color: white;
            margin-bottom: 30px;
        }

        .header h1 {
            font-size: 2.5em;
            margin-bottom: 10px;
            text-shadow: 2px 2px 4px rgba(0,0,0,0.2);
        }

        .header p {
            font-size: 1.1em;
            opacity: 0.9;
        }

        .card {
            background: white;
            border-radius: 12px;
            padding: 25px;
            margin-bottom: 20px;
            box-shadow: 0 4px 6px rgba(0,0,0,0.1);
        }

        .add-service-form {
            display: grid;
            gap: 15px;
        }

        .form-group {
            display: flex;
            flex-direction: column;
        }

        .form-row {
            display: grid;
            grid-template-columns: 1fr 1fr;
            gap: 15px;
        }

        label {
            font-weight: 600;
            margin-bottom: 5px;
            color: #333;
            font-size: 0.9em;
        }

        input, select {
            padding: 10px;
            border: 2px solid #e0e0e0;
            border-radius: 6px;
            font-size: 1em;
            transition: border-color 0.3s;
        }

        input:focus, select:focus {
            outline: none;
            border-color: #667eea;
        }

        .btn {
            padding: 12px 24px;
            border: none;
            border-radius: 6px;
            font-size: 1em;
            font-weight: 600;
            cursor: pointer;
            transition: all 0.3s;
        }

        .btn-primary {
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            color: white;
        }

        .btn-primary:hover {
            transform: translateY(-2px);
            box-shadow: 0 4px 12px rgba(102, 126, 234, 0.4);
        }

        .btn-danger {
            background: #ef4444;
            color: white;
            padding: 8px 16px;
            font-size: 0.9em;
        }

        .btn-danger:hover {
            background: #dc2626;
        }

        .btn-secondary {
            background: #6b7280;
            color: white;
        }

        .btn-secondary:hover {
            background: #4b5563;
        }

        .card-header {
            display: flex;
            justify-content: space-between;
            align-items: center;
            gap: 12px;
            margin-bottom: 20px;
        }

        .backup-actions {
            display: flex;
            gap: 10px;
            align-items: center;
            flex-wrap: wrap;
        }

        .backup-actions input[type="file"] {
            display: none;
        }

        .backup-actions .btn {
            display: inline-flex;
            align-items: center;
            justify-content: center;
            height: 44px;
            padding: 0 18px;
            line-height: 1;
            box-sizing: border-box;
            margin-bottom: 0;
        }

