bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
        .services-table {
            background: white;
            border-radius: 12px;
            padding: 25px;
            margin-top: 20px;
            box-shadow: 0 4px 6px rgba(0,0,0,0.1);
            overflow-x: auto;
        }

        .services-table table {
            width: 100%;
            border-collapse: collapse;
        }

        .services-table th {
            background: #f9fafb;
            padding: 12px 15px;
            text-align: left;
            font-weight: 600;
            color: #374151;
            border-bottom: 2px solid #e5e7eb;
            font-size: 0.9em;
        }

        .services-table td {
            padding: 12px 15px;
            border-bottom: 1px solid #e5e7eb;
            color: #6b7280;
            font-size: 0.9em;
        }

        .services-table tr:last-child td {
            border-bottom: none;
        }

        .services-table tr:hover {
            background: #f9fafb;
        }

        .services-table .service-name-cell {
            font-weight: 600;
            color: #1f2937;
        }

        .services-table .status-badge {
            display: inline-block;
            padding: 4px 10px;
            border-radius: 12px;
            font-size: 0.8em;
            font-weight: 600;
        }

        .services-table .status-badge.up {
            background: #d1fae5;
            color: #065f46;
        }

        .services-table .status-badge.down {
            background: #fee2e2;
            color: #991b1b;
        }

        .services-table .status-badge.pending {
            background: #e0e7ff;
            color: #3730a3;
        }

        .services-table .status-badge.paused {
            background: #fef3c7;
            color: #92400e;
        }

        .services-table .btn-group {
            display: flex;
            gap: 5px;
            flex-wrap: wrap;
        }

        .services-table .btn-small {
            padding: 6px 12px;
            font-size: 0.85em;
            border: none;
            border-radius: 4px;
            cursor: pointer;
            transition: all 0.2s;
            font-weight: 500;
        }

        .services-table .btn-edit {
            background: #3b82f6;
            color: white;
        }

        .services-table .btn-edit:hover {
            background: #2563eb;
        }

        .services-table .btn-pause {
            background: #f59e0b;
            color: white;
        }

        .services-table .btn-pause:hover {
            background: #d97706;
        }

        .services-table .btn-disable {
            background: #6b7280;
            color: white;
        }

        .services-table .btn-disable:hover {
            background: #4b5563;
        }

        .services-table .btn-enable {
            background: #10b981;
            color: white;
        }

        .services-table .btn-enable:hover {
            background: #059669;
        }

        .services-table .btn-clear {
            background: #8b5cf6;
            color: white;
        }

        .services-table .btn-clear:hover {
            background: #7c3aed;
        }

        .services-table .btn-delete {
            background: #ef4444;
            color: white;
        }

        .services-table .btn-delete:hover {
            background: #dc2626;
        }


        .services-grid {
            display: grid;
            grid-template-columns: repeat(auto-fill, minmax(300px, 1fr));
            gap: 20px;
        }

        .service-card {
            background: white;
            border-radius: 12px;
            padding: 20px;
            box-shadow: 0 2px 4px rgba(0,0,0,0.1);
            border-left: 4px solid #e0e0e0;
            transition: all 0.3s;
        }

        .service-card.up {
            border-left-color: #10b981;
        }

        .service-card.down {
            border-left-color: #ef4444;
        }

        .service-card.paused {
            border-left-color: #f59e0b;
            opacity: 0.8;
        }

        .service-card.pending {
            border-left-color: #6366f1;
        }

        .service-card:hover {
            transform: translateY(-4px);
            box-shadow: 0 4px 12px rgba(0,0,0,0.15);
        }

        .service-header {
            display: flex;
            justify-content: space-between;
            align-items: start;
            margin-bottom: 15px;
        }

        .service-name {
            font-size: 1.2em;
            font-weight: 700;
            color: #1f2937;
        }

        .service-status {
            display: inline-block;
            padding: 4px 12px;
            border-radius: 20px;
            font-size: 0.85em;
            font-weight: 600;
        }

        .service-status.up {
            background: #d1fae5;
            color: #065f46;
        }

        .service-status.down {
            background: #fee2e2;
            color: #991b1b;
        }

        .service-status.pending {
            background: #e0e7ff;
            color: #3730a3;
        }

        .service-info {
            margin-bottom: 10px;
            color: #6b7280;
            font-size: 0.9em;
        }

        .service-info strong {
            color: #374151;
        }

        .service-actions {
            margin-top: 15px;
            padding-top: 15px;
            border-top: 1px solid #e5e7eb;
            display: flex;
            flex-wrap: wrap;
            gap: 8px;
        }

        .modal-overlay {
            position: fixed;
            top: 0;
            left: 0;
            right: 0;
            bottom: 0;
            background: rgba(0,0,0,0.5);
            display: flex;
            align-items: center;
            justify-content: center;
            z-index: 1000;
        }

        .modal {
            background: white;
            border-radius: 12px;
            padding: 25px;
            max-width: 400px;
            width: 90%;
        }

        .modal h3 {
            margin-bottom: 15px;
            color: #1f2937;
        }

        .modal-actions {
            display: flex;
            gap: 10px;
            margin-top: 20px;
            justify-content: flex-end;
        }

        .pause-options {
            display: flex;
            flex-direction: column;
            gap: 10px;
        }

