bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
                <div class="form-row hidden" id="uptimeGroup">
                    <div class="form-group">
                        <label for="uptimeCompareOp">Comparison Operator</label>
                        <select id="uptimeCompareOp">
                            <option value="=">=  (Equal)</option>
                            <option value="<>"><>  (Not Equal)</option>
                            <option value="<"><  (Less Than)</option>
                            <option value="<="><= (Less or Equal)</option>
                            <option value=">">  (Greater Than)</option>
                            <option value=">=">>= (Greater or Equal)</option>
                        </select>
                    </div>

                    <div class="form-group">
                        <label for="uptimeThreshold">Threshold (seconds)</label>
                        <input type="number" id="uptimeThreshold" value="86400" placeholder="86400" title="Uptime threshold in seconds (e.g., 86400 = 24 hours)">
                    </div>
                </div>

                <button type="submit" class="btn btn-primary">Add Service</button>
            </form>
        </div>

        <div class="card">
            <h2 style="margin: 0 0 20px 0; color: #1f2937;">Monitored Services</h2>
            <div class="services-table">
                <table>
                    <thead>
                        <tr>
                            <th>Service Name</th>
                            <th>Type</th>
                            <th>Target</th>
                            <th>Status</th>
                            <th>Last Check</th>
                            <th>Actions</th>
                        </tr>
                    </thead>
                    <tbody id="servicesTableBody">
                    </tbody>
                </table>
            </div>
        </div>
        <div id="emptyState" class="empty-state hidden">
            <h3>No services yet</h3>
            <p>Add your first service using the form above</p>
        </div>
    </div>

    <script>
        let services = [];
        let editingServiceId = null;  // Preserve service ID when editing
        let editingPushToken = null;  // Preserve pushToken when editing PUSH services

        // Update form fields based on service type
        document.getElementById('serviceType').addEventListener('change', function() {
            const type = this.value;
            const hostGroup = document.getElementById('hostGroup');
            const hostInput = document.getElementById('serviceHost');
            const urlGroup = document.getElementById('urlGroup');
            const urlInput = document.getElementById('serviceUrl');
            const pathGroup = document.getElementById('pathGroup');
            const responseGroup = document.getElementById('responseGroup');
            const portGroup = document.getElementById('portGroup');
            const portInput = document.getElementById('servicePort');
            const snmpOidGroup = document.getElementById('snmpOidGroup');
            const snmpCommunityGroup = document.getElementById('snmpCommunityGroup');
            const snmpCompareGroup = document.getElementById('snmpCompareGroup');
            const uptimeGroup = document.getElementById('uptimeGroup');

            if (type === 'http_get') {
                // HTTP GET uses URL field only
                hostGroup.classList.add('hidden');
                hostInput.removeAttribute('required');
                urlGroup.classList.remove('hidden');
                urlInput.setAttribute('required', '');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.remove('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
                uptimeGroup.classList.add('hidden');
            } else if (type === 'push') {
                // Push type doesn't need host/port/path/url
                hostGroup.classList.add('hidden');
                hostInput.removeAttribute('required');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
                uptimeGroup.classList.add('hidden');
            } else if (type === 'ping') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
                uptimeGroup.classList.add('hidden');
            } else if (type === 'port') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.remove('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
                uptimeGroup.classList.add('hidden');
                portInput.value = 22;
            } else if (type === 'snmp_get') {
                hostGroup.classList.remove('hidden');
                hostInput.setAttribute('required', '');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.remove('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.remove('hidden');
                snmpCommunityGroup.classList.remove('hidden');
                snmpCompareGroup.classList.remove('hidden');
                uptimeGroup.classList.add('hidden');
                portInput.value = 161;
            } else if (type === 'uptime') {
                // Uptime type only needs threshold comparison fields
                hostGroup.classList.add('hidden');
                hostInput.removeAttribute('required');
                urlGroup.classList.add('hidden');
                urlInput.removeAttribute('required');
                portGroup.classList.add('hidden');
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
                uptimeGroup.classList.remove('hidden');
            }
        });

        // Add service
        document.getElementById('addServiceForm').addEventListener('submit', async function(e) {
            e.preventDefault();

            const data = {
                name: document.getElementById('serviceName').value,
                type: document.getElementById('serviceType').value,
                host: document.getElementById('serviceHost').value,
                port: parseInt(document.getElementById('servicePort').value) || 80,
                path: document.getElementById('servicePath').value,
                url: document.getElementById('serviceUrl').value,
                expectedResponse: document.getElementById('expectedResponse').value,
                checkInterval: parseInt(document.getElementById('checkInterval').value),
                passThreshold: parseInt(document.getElementById('passThreshold').value),
                failThreshold: parseInt(document.getElementById('failThreshold').value),
                rearmCount: parseInt(document.getElementById('rearmCount').value),
                snmpOid: document.getElementById('snmpOid').value,
                snmpCommunity: document.getElementById('snmpCommunity').value,
                snmpCompareOp: document.getElementById('snmpCompareOp').value,
                snmpExpectedValue: document.getElementById('snmpExpectedValue').value,
                uptimeThreshold: parseInt(document.getElementById('uptimeThreshold').value) || 86400,
                uptimeCompareOp: document.getElementById('uptimeCompareOp').value
            };

            // Preserve service ID when editing to maintain history/events
            if (editingServiceId) {
                data.id = editingServiceId;
            }

