bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
                // Delete service
        async function deleteService(id) {
            if (!confirm('Are you sure you want to delete this service?')) {
                return;
            }

            try {
                const response = await fetch(`/api/services/${id}`, {
                    method: 'DELETE'
                });

                if (response.ok) {
                    showAlert('Service deleted successfully', 'success');
                    loadServices();
                } else {
                    showAlert('Failed to delete service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Clear history for a service
        async function clearHistory(id) {
            if (!confirm('Clear all history for this service? This will reset uptime statistics.')) {
                return;
            }

            try {
                const response = await fetch(`/api/clear-history?id=${id}`, {
                    method: 'POST'
                });

                if (response.ok) {
                    showAlert('History cleared successfully', 'success');
                    loadServices();
                } else {
                    showAlert('Failed to clear history', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Edit service - loads values into form and deletes the old service
        async function editService(id) {
            const service = services.find(s => s.id === id);
            if (!service) {
                showAlert('Service not found', 'error');
                return;
            }

            // Confirm before editing
            if (!confirm('Edit this service? The current configuration will be loaded into the form for modification.')) {
                return;
            }

            // Preserve service ID to maintain history and events
            editingServiceId = id;

            // Preserve pushToken for PUSH services so URL doesn't change
            if (service.type === 'push' && service.pushToken) {
                editingPushToken = service.pushToken;
            } else {
                editingPushToken = null;
            }

            // Populate form with existing values
            document.getElementById('serviceName').value = service.name;
            document.getElementById('serviceType').value = service.type;
            document.getElementById('serviceHost').value = service.host || '';
            document.getElementById('servicePort').value = service.port || 80;
            document.getElementById('servicePath').value = service.path || '/';
            document.getElementById('serviceUrl').value = service.url || '';
            document.getElementById('expectedResponse').value = service.expectedResponse || '*';
            document.getElementById('checkInterval').value = service.checkInterval || 60;
            document.getElementById('passThreshold').value = service.passThreshold || 1;
            document.getElementById('failThreshold').value = service.failThreshold || 3;
            document.getElementById('rearmCount').value = (service.rearmCount !== undefined ? service.rearmCount : 1440);
            document.getElementById('snmpOid').value = service.snmpOid || '';
            document.getElementById('snmpCommunity').value = service.snmpCommunity || 'public';
            document.getElementById('snmpCompareOp').value = service.snmpCompareOp || '=';
            document.getElementById('snmpExpectedValue').value = service.snmpExpectedValue || '';
            document.getElementById('uptimeThreshold').value = service.uptimeThreshold || 86400;
            document.getElementById('uptimeCompareOp').value = service.uptimeCompareOp || '>';

            // Trigger change event to show/hide appropriate fields
            document.getElementById('serviceType').dispatchEvent(new Event('change'));

            // Scroll to form
            document.getElementById('addServiceForm').scrollIntoView({ behavior: 'smooth' });

            showAlert('Service loaded for editing. Make your changes and click "Add Service" to save.', 'success');
        }

        // Toggle service enabled/disabled
        async function toggleService(id, enabled) {
            try {
                const response = await fetch(`/api/services/${id}`, {
                    method: 'PATCH',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify({ enabled: enabled })
                });

                if (response.ok) {
                    showAlert(`Service ${enabled ? 'enabled' : 'disabled'} successfully`, 'success');
                    loadServices();
                } else {
                    showAlert('Failed to update service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Pause service for specified duration
        async function pauseService(id, durationSeconds) {
            try {
                const response = await fetch(`/api/services/${id}`, {
                    method: 'PATCH',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify({ pauseDuration: durationSeconds })
                });

                if (response.ok) {
                    if (durationSeconds > 0) {
                        const mins = Math.floor(durationSeconds / 60);
                        const secs = durationSeconds % 60;
                        const timeStr = mins > 0 ? `${mins} minute(s)` : `${secs} seconds`;
                        showAlert(`Service paused for ${timeStr}`, 'success');
                    } else {
                        showAlert('Service unpaused', 'success');
                    }
                    loadServices();
                    closePauseDialog();
                } else {
                    showAlert('Failed to update service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

