bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
        // Show pause duration dialog
        let currentPauseServiceId = null;
        function showPauseDialog(id) {
            currentPauseServiceId = id;
            const modal = document.createElement('div');
            modal.className = 'modal-overlay';
            modal.id = 'pauseModal';
            modal.innerHTML = `
                <div class="modal">
                    <h3>Pause Service Checks</h3>
                    <div class="pause-options">
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 300)">5 minutes</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 900)">15 minutes</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 1800)">30 minutes</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 3600)">1 hour</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 14400)">4 hours</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 86400)">24 hours</button>
                    </div>
                    <div class="modal-actions">
                        <button class="btn btn-secondary" onclick="closePauseDialog()">Cancel</button>
                    </div>
                </div>
            `;
            document.body.appendChild(modal);
            modal.addEventListener('click', function(e) {
                if (e.target === modal) closePauseDialog();
            });
        }

        function closePauseDialog() {
            const modal = document.getElementById('pauseModal');
            if (modal) modal.remove();
            currentPauseServiceId = null;
        }

        // Show alert
        function showAlert(message, type) {
            const container = document.getElementById('alertContainer');
            const alert = document.createElement('div');
            alert.className = `alert alert-${type}`;
            alert.textContent = message;
            container.appendChild(alert);

            setTimeout(() => {
                alert.remove();
            }, 3000);
        }

        // Test notifications - send test notifications to all configured channels
        async function testNotifications() {
            try {
                const response = await fetch('/api/test-notifications', {
                    method: 'POST'
                });

                const result = await response.json();

                if (response.ok && result.success) {
                    let message = 'Test notifications sent!';
                    if (result.results && result.results.length > 0) {
                        const successChannels = result.results.filter(r => r.success).map(r => r.channel);
                        const failedChannels = result.results.filter(r => !r.success).map(r => r.channel);
                        
                        if (successChannels.length > 0) {
                            message = `Test sent successfully to: ${successChannels.join(', ')}`;
                        }
                        if (failedChannels.length > 0) {
                            message += ` (Failed: ${failedChannels.join(', ')})`;
                        }
                    }
                    showAlert(message, result.allSuccess ? 'success' : 'error');
                } else if (result.error) {
                    showAlert(result.error, 'error');
                } else {
                    showAlert('Failed to send test notifications', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Export services
        function exportServices() {
            window.location.href = '/api/export';
        }

        // Import services
        async function importServices(file) {
            if (!file) return;

            try {
                const text = await file.text();
                const response = await fetch('/api/import', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: text
                });

                const result = await response.json();

                if (response.ok) {
                    showAlert(`Imported ${result.imported} service(s)` + 
                        (result.skipped > 0 ? `, skipped ${result.skipped}` : ''), 'success');
                    loadServices();
                } else {
                    showAlert('Import failed: ' + (result.error || 'Unknown error'), 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }

            // Reset file input
            document.getElementById('importFile').value = '';
        }

        // Auto-refresh services every 5 seconds
        setInterval(loadServices, 5000);

        // Initial load
        loadServices();
        document.getElementById('serviceType').dispatchEvent(new Event('change'));
    </script>
</body>
</html>)rawliteral";
}
